/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::std::mem::transmute(self)
    }
}
impl<T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]

pub const IORING_ACCEPT_MULTISHOT: u32 = 1;
pub const IORING_ACCEPT_DONTWAIT: u32 = 2;
pub const IORING_ACCEPT_POLL_FIRST: u32 = 4;
pub const IORING_MSG_RING_CQE_SKIP: u32 = 1;
pub const IORING_MSG_RING_FLAGS_PASS: u32 = 2;
pub const IORING_FIXED_FD_NO_CLOEXEC: u32 = 1;
pub const IORING_NOP_INJECT_RESULT: u32 = 1;
pub const IORING_CQE_F_BUFFER: u32 = 1;
pub const IORING_CQE_F_MORE: u32 = 2;
pub const IORING_CQE_F_SOCK_NONEMPTY: u32 = 4;
pub const IORING_CQE_F_NOTIF: u32 = 8;
pub const IORING_CQE_F_BUF_MORE: u32 = 16;
pub const IORING_CQE_BUFFER_SHIFT: u32 = 16;
pub const IORING_OFF_SQ_RING: u32 = 0;
pub const IORING_OFF_CQ_RING: u32 = 134217728;
pub const IORING_OFF_SQES: u32 = 268435456;
pub const IORING_OFF_PBUF_RING: u32 = 2147483648;
pub const IORING_OFF_PBUF_SHIFT: u32 = 16;
pub const IORING_OFF_MMAP_MASK: u32 = 4160749568;
pub const IORING_SQ_NEED_WAKEUP: u32 = 1;
pub const IORING_SQ_CQ_OVERFLOW: u32 = 2;
pub const IORING_SQ_TASKRUN: u32 = 4;
pub const IORING_CQ_EVENTFD_DISABLED: u32 = 1;
pub const IORING_ENTER_GETEVENTS: u32 = 1;
pub const IORING_ENTER_SQ_WAKEUP: u32 = 2;
pub const IORING_ENTER_SQ_WAIT: u32 = 4;
pub const IORING_ENTER_EXT_ARG: u32 = 8;
pub const IORING_ENTER_REGISTERED_RING: u32 = 16;
pub const IORING_ENTER_ABS_TIMER: u32 = 32;
pub const IORING_ENTER_EXT_ARG_REG: u32 = 64;
pub const IORING_FEAT_SINGLE_MMAP: u32 = 1;
pub const IORING_FEAT_NODROP: u32 = 2;
pub const IORING_FEAT_SUBMIT_STABLE: u32 = 4;
pub const IORING_FEAT_RW_CUR_POS: u32 = 8;
pub const IORING_FEAT_CUR_PERSONALITY: u32 = 16;
pub const IORING_FEAT_FAST_POLL: u32 = 32;
pub const IORING_FEAT_POLL_32BITS: u32 = 64;
pub const IORING_FEAT_SQPOLL_NONFIXED: u32 = 128;
pub const IORING_FEAT_EXT_ARG: u32 = 256;
pub const IORING_FEAT_NATIVE_WORKERS: u32 = 512;
pub const IORING_FEAT_RSRC_TAGS: u32 = 1024;
pub const IORING_FEAT_CQE_SKIP: u32 = 2048;
pub const IORING_FEAT_LINKED_FILE: u32 = 4096;
pub const IORING_FEAT_REG_REG_RING: u32 = 8192;
pub const IORING_FEAT_RECVSEND_BUNDLE: u32 = 16384;
pub const IORING_FEAT_MIN_TIMEOUT: u32 = 32768;
pub const IORING_RSRC_REGISTER_SPARSE: u32 = 1;
pub const IORING_REGISTER_FILES_SKIP: i32 = -2;
pub const BUFRINGS_CONN: u32 = 0;
pub const BUFRINGS_WRITE: u32 = 0;
pub const BUFRINGS: u32 = 2;
pub const REGISTERED_BUFFERS: u32 = 16;
pub const REGISTERED_BUFFER_SIZE: u32 = 1024;
pub const FMT_ADDRLEN: u32 = 32;
pub const LOGGING_BUFSIZE: u32 = 256;
pub const TRACE_LEVEL_BUFSIZE: u32 = 8;
pub const COLOR_RESET: &[u8; 5] = b"\x1B[0m\0";
pub const COLOR_YELLOW: &[u8; 6] = b"\x1B[33m\0";
pub const COLOR_BLUE: &[u8; 6] = b"\x1B[34m\0";
pub const COLOR_MAGENTA: &[u8; 6] = b"\x1B[35m\0";
pub const COLOR_CYAN: &[u8; 6] = b"\x1B[36m\0";
pub const COLOR_RED: &[u8; 6] = b"\x1B[31m\0";
pub const COLOR_BRIGHT_GREEN: &[u8; 6] = b"\x1B[92m\0";
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of iovec"][::std::mem::size_of::<iovec>() - 16usize];
    ["Alignment of iovec"][::std::mem::align_of::<iovec>() - 8usize];
    ["Offset of field: iovec::iov_base"][::std::mem::offset_of!(iovec, iov_base) - 0usize];
    ["Offset of field: iovec::iov_len"][::std::mem::offset_of!(iovec, iov_len) - 8usize];
};
impl Default for iovec {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __off_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
pub type __clock_t = ::std::os::raw::c_long;
pub type __id_t = ::std::os::raw::c_uint;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type mode_t = __mode_t;
pub type off_t = __off_t;
pub type id_t = __id_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
pub type socklen_t = __socklen_t;
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr"][::std::mem::size_of::<sockaddr>() - 16usize];
    ["Alignment of sockaddr"][::std::mem::align_of::<sockaddr>() - 2usize];
    ["Offset of field: sockaddr::sa_family"][::std::mem::offset_of!(sockaddr, sa_family) - 0usize];
    ["Offset of field: sockaddr::sa_data"][::std::mem::offset_of!(sockaddr, sa_data) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: usize,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: usize,
    pub msg_flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of msghdr"][::std::mem::size_of::<msghdr>() - 56usize];
    ["Alignment of msghdr"][::std::mem::align_of::<msghdr>() - 8usize];
    ["Offset of field: msghdr::msg_name"][::std::mem::offset_of!(msghdr, msg_name) - 0usize];
    ["Offset of field: msghdr::msg_namelen"][::std::mem::offset_of!(msghdr, msg_namelen) - 8usize];
    ["Offset of field: msghdr::msg_iov"][::std::mem::offset_of!(msghdr, msg_iov) - 16usize];
    ["Offset of field: msghdr::msg_iovlen"][::std::mem::offset_of!(msghdr, msg_iovlen) - 24usize];
    ["Offset of field: msghdr::msg_control"][::std::mem::offset_of!(msghdr, msg_control) - 32usize];
    ["Offset of field: msghdr::msg_controllen"]
        [::std::mem::offset_of!(msghdr, msg_controllen) - 40usize];
    ["Offset of field: msghdr::msg_flags"][::std::mem::offset_of!(msghdr, msg_flags) - 48usize];
};
impl Default for msghdr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct cmsghdr {
    pub cmsg_len: usize,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
    pub __cmsg_data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cmsghdr"][::std::mem::size_of::<cmsghdr>() - 16usize];
    ["Alignment of cmsghdr"][::std::mem::align_of::<cmsghdr>() - 8usize];
    ["Offset of field: cmsghdr::cmsg_len"][::std::mem::offset_of!(cmsghdr, cmsg_len) - 0usize];
    ["Offset of field: cmsghdr::cmsg_level"][::std::mem::offset_of!(cmsghdr, cmsg_level) - 8usize];
    ["Offset of field: cmsghdr::cmsg_type"][::std::mem::offset_of!(cmsghdr, cmsg_type) - 12usize];
    ["Offset of field: cmsghdr::__cmsg_data"]
        [::std::mem::offset_of!(cmsghdr, __cmsg_data) - 16usize];
};
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigval {
    pub sival_int: ::std::os::raw::c_int,
    pub sival_ptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigval"][::std::mem::size_of::<sigval>() - 8usize];
    ["Alignment of sigval"][::std::mem::align_of::<sigval>() - 8usize];
    ["Offset of field: sigval::sival_int"][::std::mem::offset_of!(sigval, sival_int) - 0usize];
    ["Offset of field: sigval::sival_ptr"][::std::mem::offset_of!(sigval, sival_ptr) - 0usize];
};
impl Default for sigval {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __sigval_t = sigval;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t {
    pub si_signo: ::std::os::raw::c_int,
    pub si_errno: ::std::os::raw::c_int,
    pub si_code: ::std::os::raw::c_int,
    pub __pad0: ::std::os::raw::c_int,
    pub _sifields: siginfo_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union siginfo_t__bindgen_ty_1 {
    pub _pad: [::std::os::raw::c_int; 28usize],
    pub _kill: siginfo_t__bindgen_ty_1__bindgen_ty_1,
    pub _timer: siginfo_t__bindgen_ty_1__bindgen_ty_2,
    pub _rt: siginfo_t__bindgen_ty_1__bindgen_ty_3,
    pub _sigchld: siginfo_t__bindgen_ty_1__bindgen_ty_4,
    pub _sigfault: siginfo_t__bindgen_ty_1__bindgen_ty_5,
    pub _sigpoll: siginfo_t__bindgen_ty_1__bindgen_ty_6,
    pub _sigsys: siginfo_t__bindgen_ty_1__bindgen_ty_7,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_1 {
    pub si_pid: __pid_t,
    pub si_uid: __uid_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1::si_pid"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_1, si_pid) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1::si_uid"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_1, si_uid) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_2 {
    pub si_tid: ::std::os::raw::c_int,
    pub si_overrun: ::std::os::raw::c_int,
    pub si_sigval: __sigval_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_2>() - 16usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_2::si_tid"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_2, si_tid) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_2::si_overrun"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_2, si_overrun) - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_2::si_sigval"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_2, si_sigval) - 8usize];
};
impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_3 {
    pub si_pid: __pid_t,
    pub si_uid: __uid_t,
    pub si_sigval: __sigval_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_3>() - 16usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_3"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_3::si_pid"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_3, si_pid) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_3::si_uid"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_3, si_uid) - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_3::si_sigval"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_3, si_sigval) - 8usize];
};
impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_3 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_4 {
    pub si_pid: __pid_t,
    pub si_uid: __uid_t,
    pub si_status: ::std::os::raw::c_int,
    pub si_utime: __clock_t,
    pub si_stime: __clock_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_4>() - 32usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_4"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_pid"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_pid) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_uid"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_uid) - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_status"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_status) - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_utime"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_utime) - 16usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_stime"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_stime) - 24usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_5 {
    pub si_addr: *mut ::std::os::raw::c_void,
    pub si_addr_lsb: ::std::os::raw::c_short,
    pub _bounds: siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 {
    pub _addr_bnd: siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
    pub _pkey: __uint32_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1 {
    pub _lower: *mut ::std::os::raw::c_void,
    pub _upper: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1>(
        ) - 16usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1>(
        ) - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1::_lower"] [:: std :: mem :: offset_of ! (siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1 , _lower) - 0usize] ;
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1::_upper"] [:: std :: mem :: offset_of ! (siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1 , _upper) - 8usize] ;
};
impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1>() - 16usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1>() - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1::_addr_bnd"][::std::mem::offset_of!(
        siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
        _addr_bnd
    ) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1::_pkey"][::std::mem::offset_of!(
        siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1,
        _pkey
    ) - 0usize];
};
impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_5__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5>() - 32usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_5"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_5>() - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_5::si_addr"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_5, si_addr) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_5::si_addr_lsb"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_5, si_addr_lsb) - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_5::_bounds"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_5, _bounds) - 16usize];
};
impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_5 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_6 {
    pub si_band: ::std::os::raw::c_long,
    pub si_fd: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_6"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_6>() - 16usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_6"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_6>() - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_6::si_band"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_6, si_band) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_6::si_fd"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_6, si_fd) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_7 {
    pub _call_addr: *mut ::std::os::raw::c_void,
    pub _syscall: ::std::os::raw::c_int,
    pub _arch: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_7"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_7>() - 16usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_7"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_7>() - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_7::_call_addr"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_7, _call_addr) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_7::_syscall"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_7, _syscall) - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_7::_arch"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_7, _arch) - 12usize];
};
impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_7 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1"]
        [::std::mem::size_of::<siginfo_t__bindgen_ty_1>() - 112usize];
    ["Alignment of siginfo_t__bindgen_ty_1"]
        [::std::mem::align_of::<siginfo_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::_pad"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _pad) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::_kill"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _kill) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::_timer"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _timer) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::_rt"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _rt) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::_sigchld"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _sigchld) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::_sigfault"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _sigfault) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::_sigpoll"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _sigpoll) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::_sigsys"]
        [::std::mem::offset_of!(siginfo_t__bindgen_ty_1, _sigsys) - 0usize];
};
impl Default for siginfo_t__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t"][::std::mem::size_of::<siginfo_t>() - 128usize];
    ["Alignment of siginfo_t"][::std::mem::align_of::<siginfo_t>() - 8usize];
    ["Offset of field: siginfo_t::si_signo"][::std::mem::offset_of!(siginfo_t, si_signo) - 0usize];
    ["Offset of field: siginfo_t::si_errno"][::std::mem::offset_of!(siginfo_t, si_errno) - 4usize];
    ["Offset of field: siginfo_t::si_code"][::std::mem::offset_of!(siginfo_t, si_code) - 8usize];
    ["Offset of field: siginfo_t::__pad0"][::std::mem::offset_of!(siginfo_t, __pad0) - 12usize];
    ["Offset of field: siginfo_t::_sifields"]
        [::std::mem::offset_of!(siginfo_t, _sifields) - 16usize];
};
impl Default for siginfo_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __u8 = ::std::os::raw::c_uchar;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __u64 = ::std::os::raw::c_ulonglong;
pub const idtype_t_P_ALL: idtype_t = 0;
pub const idtype_t_P_PID: idtype_t = 1;
pub const idtype_t_P_PGID: idtype_t = 2;
pub const idtype_t_P_PIDFD: idtype_t = 3;
pub type idtype_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_timespec {
    pub tv_sec: __kernel_time64_t,
    pub tv_nsec: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_timespec"][::std::mem::size_of::<__kernel_timespec>() - 16usize];
    ["Alignment of __kernel_timespec"][::std::mem::align_of::<__kernel_timespec>() - 8usize];
    ["Offset of field: __kernel_timespec::tv_sec"]
        [::std::mem::offset_of!(__kernel_timespec, tv_sec) - 0usize];
    ["Offset of field: __kernel_timespec::tv_nsec"]
        [::std::mem::offset_of!(__kernel_timespec, tv_nsec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct open_how {
    pub flags: __u64,
    pub mode: __u64,
    pub resolve: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of open_how"][::std::mem::size_of::<open_how>() - 24usize];
    ["Alignment of open_how"][::std::mem::align_of::<open_how>() - 8usize];
    ["Offset of field: open_how::flags"][::std::mem::offset_of!(open_how, flags) - 0usize];
    ["Offset of field: open_how::mode"][::std::mem::offset_of!(open_how, mode) - 8usize];
    ["Offset of field: open_how::resolve"][::std::mem::offset_of!(open_how, resolve) - 16usize];
};
pub type __kernel_rwf_t = ::std::os::raw::c_int;
#[repr(C)]
pub struct io_uring_sqe {
    pub opcode: __u8,
    pub flags: __u8,
    pub ioprio: __u16,
    pub fd: __s32,
    pub __bindgen_anon_1: io_uring_sqe__bindgen_ty_1,
    pub __bindgen_anon_2: io_uring_sqe__bindgen_ty_2,
    pub len: __u32,
    pub __bindgen_anon_3: io_uring_sqe__bindgen_ty_3,
    pub user_data: __u64,
    pub __bindgen_anon_4: io_uring_sqe__bindgen_ty_4,
    pub personality: __u16,
    pub __bindgen_anon_5: io_uring_sqe__bindgen_ty_5,
    pub __bindgen_anon_6: io_uring_sqe__bindgen_ty_6,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union io_uring_sqe__bindgen_ty_1 {
    pub off: __u64,
    pub addr2: __u64,
    pub __bindgen_anon_1: io_uring_sqe__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_sqe__bindgen_ty_1__bindgen_ty_1 {
    pub cmd_op: __u32,
    pub __pad1: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<io_uring_sqe__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of io_uring_sqe__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<io_uring_sqe__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_1__bindgen_ty_1::cmd_op"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_1__bindgen_ty_1, cmd_op) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_1__bindgen_ty_1::__pad1"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_1__bindgen_ty_1, __pad1) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_1"]
        [::std::mem::size_of::<io_uring_sqe__bindgen_ty_1>() - 8usize];
    ["Alignment of io_uring_sqe__bindgen_ty_1"]
        [::std::mem::align_of::<io_uring_sqe__bindgen_ty_1>() - 8usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_1::off"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_1, off) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_1::addr2"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_1, addr2) - 0usize];
};
impl Default for io_uring_sqe__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union io_uring_sqe__bindgen_ty_2 {
    pub addr: __u64,
    pub splice_off_in: __u64,
    pub __bindgen_anon_1: io_uring_sqe__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_sqe__bindgen_ty_2__bindgen_ty_1 {
    pub level: __u32,
    pub optname: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::size_of::<io_uring_sqe__bindgen_ty_2__bindgen_ty_1>() - 8usize];
    ["Alignment of io_uring_sqe__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::align_of::<io_uring_sqe__bindgen_ty_2__bindgen_ty_1>() - 4usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_2__bindgen_ty_1::level"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_2__bindgen_ty_1, level) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_2__bindgen_ty_1::optname"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_2__bindgen_ty_1, optname) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_2"]
        [::std::mem::size_of::<io_uring_sqe__bindgen_ty_2>() - 8usize];
    ["Alignment of io_uring_sqe__bindgen_ty_2"]
        [::std::mem::align_of::<io_uring_sqe__bindgen_ty_2>() - 8usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_2::addr"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_2, addr) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_2::splice_off_in"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_2, splice_off_in) - 0usize];
};
impl Default for io_uring_sqe__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union io_uring_sqe__bindgen_ty_3 {
    pub rw_flags: __kernel_rwf_t,
    pub fsync_flags: __u32,
    pub poll_events: __u16,
    pub poll32_events: __u32,
    pub sync_range_flags: __u32,
    pub msg_flags: __u32,
    pub timeout_flags: __u32,
    pub accept_flags: __u32,
    pub cancel_flags: __u32,
    pub open_flags: __u32,
    pub statx_flags: __u32,
    pub fadvise_advice: __u32,
    pub splice_flags: __u32,
    pub rename_flags: __u32,
    pub unlink_flags: __u32,
    pub hardlink_flags: __u32,
    pub xattr_flags: __u32,
    pub msg_ring_flags: __u32,
    pub uring_cmd_flags: __u32,
    pub waitid_flags: __u32,
    pub futex_flags: __u32,
    pub install_fd_flags: __u32,
    pub nop_flags: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_3"]
        [::std::mem::size_of::<io_uring_sqe__bindgen_ty_3>() - 4usize];
    ["Alignment of io_uring_sqe__bindgen_ty_3"]
        [::std::mem::align_of::<io_uring_sqe__bindgen_ty_3>() - 4usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::rw_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, rw_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::fsync_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, fsync_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::poll_events"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, poll_events) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::poll32_events"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, poll32_events) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::sync_range_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, sync_range_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::msg_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, msg_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::timeout_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, timeout_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::accept_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, accept_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::cancel_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, cancel_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::open_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, open_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::statx_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, statx_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::fadvise_advice"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, fadvise_advice) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::splice_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, splice_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::rename_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, rename_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::unlink_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, unlink_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::hardlink_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, hardlink_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::xattr_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, xattr_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::msg_ring_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, msg_ring_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::uring_cmd_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, uring_cmd_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::waitid_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, waitid_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::futex_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, futex_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::install_fd_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, install_fd_flags) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_3::nop_flags"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_3, nop_flags) - 0usize];
};
impl Default for io_uring_sqe__bindgen_ty_3 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub union io_uring_sqe__bindgen_ty_4 {
    pub buf_index: __u16,
    pub buf_group: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_4"]
        [::std::mem::size_of::<io_uring_sqe__bindgen_ty_4>() - 2usize];
    ["Alignment of io_uring_sqe__bindgen_ty_4"]
        [::std::mem::align_of::<io_uring_sqe__bindgen_ty_4>() - 1usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_4::buf_index"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_4, buf_index) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_4::buf_group"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_4, buf_group) - 0usize];
};
impl Default for io_uring_sqe__bindgen_ty_4 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union io_uring_sqe__bindgen_ty_5 {
    pub splice_fd_in: __s32,
    pub file_index: __u32,
    pub optlen: __u32,
    pub __bindgen_anon_1: io_uring_sqe__bindgen_ty_5__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_sqe__bindgen_ty_5__bindgen_ty_1 {
    pub addr_len: __u16,
    pub __pad3: [__u16; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_5__bindgen_ty_1"]
        [::std::mem::size_of::<io_uring_sqe__bindgen_ty_5__bindgen_ty_1>() - 4usize];
    ["Alignment of io_uring_sqe__bindgen_ty_5__bindgen_ty_1"]
        [::std::mem::align_of::<io_uring_sqe__bindgen_ty_5__bindgen_ty_1>() - 2usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_5__bindgen_ty_1::addr_len"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_5__bindgen_ty_1, addr_len) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_5__bindgen_ty_1::__pad3"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_5__bindgen_ty_1, __pad3) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_5"]
        [::std::mem::size_of::<io_uring_sqe__bindgen_ty_5>() - 4usize];
    ["Alignment of io_uring_sqe__bindgen_ty_5"]
        [::std::mem::align_of::<io_uring_sqe__bindgen_ty_5>() - 4usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_5::splice_fd_in"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_5, splice_fd_in) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_5::file_index"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_5, file_index) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_5::optlen"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_5, optlen) - 0usize];
};
impl Default for io_uring_sqe__bindgen_ty_5 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct io_uring_sqe__bindgen_ty_6 {
    pub __bindgen_anon_1: __BindgenUnionField<io_uring_sqe__bindgen_ty_6__bindgen_ty_1>,
    pub optval: __BindgenUnionField<__u64>,
    pub cmd: __BindgenUnionField<[__u8; 0usize]>,
    pub bindgen_union_field: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_sqe__bindgen_ty_6__bindgen_ty_1 {
    pub addr3: __u64,
    pub __pad2: [__u64; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_6__bindgen_ty_1"]
        [::std::mem::size_of::<io_uring_sqe__bindgen_ty_6__bindgen_ty_1>() - 16usize];
    ["Alignment of io_uring_sqe__bindgen_ty_6__bindgen_ty_1"]
        [::std::mem::align_of::<io_uring_sqe__bindgen_ty_6__bindgen_ty_1>() - 8usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_6__bindgen_ty_1::addr3"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_6__bindgen_ty_1, addr3) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_6__bindgen_ty_1::__pad2"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_6__bindgen_ty_1, __pad2) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_6"]
        [::std::mem::size_of::<io_uring_sqe__bindgen_ty_6>() - 16usize];
    ["Alignment of io_uring_sqe__bindgen_ty_6"]
        [::std::mem::align_of::<io_uring_sqe__bindgen_ty_6>() - 8usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_6::optval"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_6, optval) - 0usize];
    ["Offset of field: io_uring_sqe__bindgen_ty_6::cmd"]
        [::std::mem::offset_of!(io_uring_sqe__bindgen_ty_6, cmd) - 0usize];
};
impl Default for io_uring_sqe__bindgen_ty_6 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe"][::std::mem::size_of::<io_uring_sqe>() - 64usize];
    ["Alignment of io_uring_sqe"][::std::mem::align_of::<io_uring_sqe>() - 8usize];
    ["Offset of field: io_uring_sqe::opcode"]
        [::std::mem::offset_of!(io_uring_sqe, opcode) - 0usize];
    ["Offset of field: io_uring_sqe::flags"][::std::mem::offset_of!(io_uring_sqe, flags) - 1usize];
    ["Offset of field: io_uring_sqe::ioprio"]
        [::std::mem::offset_of!(io_uring_sqe, ioprio) - 2usize];
    ["Offset of field: io_uring_sqe::fd"][::std::mem::offset_of!(io_uring_sqe, fd) - 4usize];
    ["Offset of field: io_uring_sqe::len"][::std::mem::offset_of!(io_uring_sqe, len) - 24usize];
    ["Offset of field: io_uring_sqe::user_data"]
        [::std::mem::offset_of!(io_uring_sqe, user_data) - 32usize];
    ["Offset of field: io_uring_sqe::personality"]
        [::std::mem::offset_of!(io_uring_sqe, personality) - 42usize];
};
impl Default for io_uring_sqe {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const io_uring_sqe_flags_bit_IOSQE_FIXED_FILE_BIT: io_uring_sqe_flags_bit = 0;
pub const io_uring_sqe_flags_bit_IOSQE_IO_DRAIN_BIT: io_uring_sqe_flags_bit = 1;
pub const io_uring_sqe_flags_bit_IOSQE_IO_LINK_BIT: io_uring_sqe_flags_bit = 2;
pub const io_uring_sqe_flags_bit_IOSQE_IO_HARDLINK_BIT: io_uring_sqe_flags_bit = 3;
pub const io_uring_sqe_flags_bit_IOSQE_ASYNC_BIT: io_uring_sqe_flags_bit = 4;
pub const io_uring_sqe_flags_bit_IOSQE_BUFFER_SELECT_BIT: io_uring_sqe_flags_bit = 5;
pub const io_uring_sqe_flags_bit_IOSQE_CQE_SKIP_SUCCESS_BIT: io_uring_sqe_flags_bit = 6;
pub type io_uring_sqe_flags_bit = ::std::os::raw::c_uint;
pub const io_uring_op_IORING_OP_NOP: io_uring_op = 0;
pub const io_uring_op_IORING_OP_READV: io_uring_op = 1;
pub const io_uring_op_IORING_OP_WRITEV: io_uring_op = 2;
pub const io_uring_op_IORING_OP_FSYNC: io_uring_op = 3;
pub const io_uring_op_IORING_OP_READ_FIXED: io_uring_op = 4;
pub const io_uring_op_IORING_OP_WRITE_FIXED: io_uring_op = 5;
pub const io_uring_op_IORING_OP_POLL_ADD: io_uring_op = 6;
pub const io_uring_op_IORING_OP_POLL_REMOVE: io_uring_op = 7;
pub const io_uring_op_IORING_OP_SYNC_FILE_RANGE: io_uring_op = 8;
pub const io_uring_op_IORING_OP_SENDMSG: io_uring_op = 9;
pub const io_uring_op_IORING_OP_RECVMSG: io_uring_op = 10;
pub const io_uring_op_IORING_OP_TIMEOUT: io_uring_op = 11;
pub const io_uring_op_IORING_OP_TIMEOUT_REMOVE: io_uring_op = 12;
pub const io_uring_op_IORING_OP_ACCEPT: io_uring_op = 13;
pub const io_uring_op_IORING_OP_ASYNC_CANCEL: io_uring_op = 14;
pub const io_uring_op_IORING_OP_LINK_TIMEOUT: io_uring_op = 15;
pub const io_uring_op_IORING_OP_CONNECT: io_uring_op = 16;
pub const io_uring_op_IORING_OP_FALLOCATE: io_uring_op = 17;
pub const io_uring_op_IORING_OP_OPENAT: io_uring_op = 18;
pub const io_uring_op_IORING_OP_CLOSE: io_uring_op = 19;
pub const io_uring_op_IORING_OP_FILES_UPDATE: io_uring_op = 20;
pub const io_uring_op_IORING_OP_STATX: io_uring_op = 21;
pub const io_uring_op_IORING_OP_READ: io_uring_op = 22;
pub const io_uring_op_IORING_OP_WRITE: io_uring_op = 23;
pub const io_uring_op_IORING_OP_FADVISE: io_uring_op = 24;
pub const io_uring_op_IORING_OP_MADVISE: io_uring_op = 25;
pub const io_uring_op_IORING_OP_SEND: io_uring_op = 26;
pub const io_uring_op_IORING_OP_RECV: io_uring_op = 27;
pub const io_uring_op_IORING_OP_OPENAT2: io_uring_op = 28;
pub const io_uring_op_IORING_OP_EPOLL_CTL: io_uring_op = 29;
pub const io_uring_op_IORING_OP_SPLICE: io_uring_op = 30;
pub const io_uring_op_IORING_OP_PROVIDE_BUFFERS: io_uring_op = 31;
pub const io_uring_op_IORING_OP_REMOVE_BUFFERS: io_uring_op = 32;
pub const io_uring_op_IORING_OP_TEE: io_uring_op = 33;
pub const io_uring_op_IORING_OP_SHUTDOWN: io_uring_op = 34;
pub const io_uring_op_IORING_OP_RENAMEAT: io_uring_op = 35;
pub const io_uring_op_IORING_OP_UNLINKAT: io_uring_op = 36;
pub const io_uring_op_IORING_OP_MKDIRAT: io_uring_op = 37;
pub const io_uring_op_IORING_OP_SYMLINKAT: io_uring_op = 38;
pub const io_uring_op_IORING_OP_LINKAT: io_uring_op = 39;
pub const io_uring_op_IORING_OP_MSG_RING: io_uring_op = 40;
pub const io_uring_op_IORING_OP_FSETXATTR: io_uring_op = 41;
pub const io_uring_op_IORING_OP_SETXATTR: io_uring_op = 42;
pub const io_uring_op_IORING_OP_FGETXATTR: io_uring_op = 43;
pub const io_uring_op_IORING_OP_GETXATTR: io_uring_op = 44;
pub const io_uring_op_IORING_OP_SOCKET: io_uring_op = 45;
pub const io_uring_op_IORING_OP_URING_CMD: io_uring_op = 46;
pub const io_uring_op_IORING_OP_SEND_ZC: io_uring_op = 47;
pub const io_uring_op_IORING_OP_SENDMSG_ZC: io_uring_op = 48;
pub const io_uring_op_IORING_OP_READ_MULTISHOT: io_uring_op = 49;
pub const io_uring_op_IORING_OP_WAITID: io_uring_op = 50;
pub const io_uring_op_IORING_OP_FUTEX_WAIT: io_uring_op = 51;
pub const io_uring_op_IORING_OP_FUTEX_WAKE: io_uring_op = 52;
pub const io_uring_op_IORING_OP_FUTEX_WAITV: io_uring_op = 53;
pub const io_uring_op_IORING_OP_FIXED_FD_INSTALL: io_uring_op = 54;
pub const io_uring_op_IORING_OP_FTRUNCATE: io_uring_op = 55;
pub const io_uring_op_IORING_OP_BIND: io_uring_op = 56;
pub const io_uring_op_IORING_OP_LISTEN: io_uring_op = 57;
pub const io_uring_op_IORING_OP_LAST: io_uring_op = 58;
pub type io_uring_op = ::std::os::raw::c_uint;
pub const io_uring_msg_ring_flags_IORING_MSG_DATA: io_uring_msg_ring_flags = 0;
pub const io_uring_msg_ring_flags_IORING_MSG_SEND_FD: io_uring_msg_ring_flags = 1;
pub type io_uring_msg_ring_flags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default)]
pub struct io_uring_cqe {
    pub user_data: __u64,
    pub res: __s32,
    pub flags: __u32,
    pub big_cqe: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_cqe"][::std::mem::size_of::<io_uring_cqe>() - 16usize];
    ["Alignment of io_uring_cqe"][::std::mem::align_of::<io_uring_cqe>() - 8usize];
    ["Offset of field: io_uring_cqe::user_data"]
        [::std::mem::offset_of!(io_uring_cqe, user_data) - 0usize];
    ["Offset of field: io_uring_cqe::res"][::std::mem::offset_of!(io_uring_cqe, res) - 8usize];
    ["Offset of field: io_uring_cqe::flags"][::std::mem::offset_of!(io_uring_cqe, flags) - 12usize];
    ["Offset of field: io_uring_cqe::big_cqe"]
        [::std::mem::offset_of!(io_uring_cqe, big_cqe) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_sqring_offsets {
    pub head: __u32,
    pub tail: __u32,
    pub ring_mask: __u32,
    pub ring_entries: __u32,
    pub flags: __u32,
    pub dropped: __u32,
    pub array: __u32,
    pub resv1: __u32,
    pub user_addr: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_sqring_offsets"][::std::mem::size_of::<io_sqring_offsets>() - 40usize];
    ["Alignment of io_sqring_offsets"][::std::mem::align_of::<io_sqring_offsets>() - 8usize];
    ["Offset of field: io_sqring_offsets::head"]
        [::std::mem::offset_of!(io_sqring_offsets, head) - 0usize];
    ["Offset of field: io_sqring_offsets::tail"]
        [::std::mem::offset_of!(io_sqring_offsets, tail) - 4usize];
    ["Offset of field: io_sqring_offsets::ring_mask"]
        [::std::mem::offset_of!(io_sqring_offsets, ring_mask) - 8usize];
    ["Offset of field: io_sqring_offsets::ring_entries"]
        [::std::mem::offset_of!(io_sqring_offsets, ring_entries) - 12usize];
    ["Offset of field: io_sqring_offsets::flags"]
        [::std::mem::offset_of!(io_sqring_offsets, flags) - 16usize];
    ["Offset of field: io_sqring_offsets::dropped"]
        [::std::mem::offset_of!(io_sqring_offsets, dropped) - 20usize];
    ["Offset of field: io_sqring_offsets::array"]
        [::std::mem::offset_of!(io_sqring_offsets, array) - 24usize];
    ["Offset of field: io_sqring_offsets::resv1"]
        [::std::mem::offset_of!(io_sqring_offsets, resv1) - 28usize];
    ["Offset of field: io_sqring_offsets::user_addr"]
        [::std::mem::offset_of!(io_sqring_offsets, user_addr) - 32usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_cqring_offsets {
    pub head: __u32,
    pub tail: __u32,
    pub ring_mask: __u32,
    pub ring_entries: __u32,
    pub overflow: __u32,
    pub cqes: __u32,
    pub flags: __u32,
    pub resv1: __u32,
    pub user_addr: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_cqring_offsets"][::std::mem::size_of::<io_cqring_offsets>() - 40usize];
    ["Alignment of io_cqring_offsets"][::std::mem::align_of::<io_cqring_offsets>() - 8usize];
    ["Offset of field: io_cqring_offsets::head"]
        [::std::mem::offset_of!(io_cqring_offsets, head) - 0usize];
    ["Offset of field: io_cqring_offsets::tail"]
        [::std::mem::offset_of!(io_cqring_offsets, tail) - 4usize];
    ["Offset of field: io_cqring_offsets::ring_mask"]
        [::std::mem::offset_of!(io_cqring_offsets, ring_mask) - 8usize];
    ["Offset of field: io_cqring_offsets::ring_entries"]
        [::std::mem::offset_of!(io_cqring_offsets, ring_entries) - 12usize];
    ["Offset of field: io_cqring_offsets::overflow"]
        [::std::mem::offset_of!(io_cqring_offsets, overflow) - 16usize];
    ["Offset of field: io_cqring_offsets::cqes"]
        [::std::mem::offset_of!(io_cqring_offsets, cqes) - 20usize];
    ["Offset of field: io_cqring_offsets::flags"]
        [::std::mem::offset_of!(io_cqring_offsets, flags) - 24usize];
    ["Offset of field: io_cqring_offsets::resv1"]
        [::std::mem::offset_of!(io_cqring_offsets, resv1) - 28usize];
    ["Offset of field: io_cqring_offsets::user_addr"]
        [::std::mem::offset_of!(io_cqring_offsets, user_addr) - 32usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_params {
    pub sq_entries: __u32,
    pub cq_entries: __u32,
    pub flags: __u32,
    pub sq_thread_cpu: __u32,
    pub sq_thread_idle: __u32,
    pub features: __u32,
    pub wq_fd: __u32,
    pub resv: [__u32; 3usize],
    pub sq_off: io_sqring_offsets,
    pub cq_off: io_cqring_offsets,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_params"][::std::mem::size_of::<io_uring_params>() - 120usize];
    ["Alignment of io_uring_params"][::std::mem::align_of::<io_uring_params>() - 8usize];
    ["Offset of field: io_uring_params::sq_entries"]
        [::std::mem::offset_of!(io_uring_params, sq_entries) - 0usize];
    ["Offset of field: io_uring_params::cq_entries"]
        [::std::mem::offset_of!(io_uring_params, cq_entries) - 4usize];
    ["Offset of field: io_uring_params::flags"]
        [::std::mem::offset_of!(io_uring_params, flags) - 8usize];
    ["Offset of field: io_uring_params::sq_thread_cpu"]
        [::std::mem::offset_of!(io_uring_params, sq_thread_cpu) - 12usize];
    ["Offset of field: io_uring_params::sq_thread_idle"]
        [::std::mem::offset_of!(io_uring_params, sq_thread_idle) - 16usize];
    ["Offset of field: io_uring_params::features"]
        [::std::mem::offset_of!(io_uring_params, features) - 20usize];
    ["Offset of field: io_uring_params::wq_fd"]
        [::std::mem::offset_of!(io_uring_params, wq_fd) - 24usize];
    ["Offset of field: io_uring_params::resv"]
        [::std::mem::offset_of!(io_uring_params, resv) - 28usize];
    ["Offset of field: io_uring_params::sq_off"]
        [::std::mem::offset_of!(io_uring_params, sq_off) - 40usize];
    ["Offset of field: io_uring_params::cq_off"]
        [::std::mem::offset_of!(io_uring_params, cq_off) - 80usize];
};
pub const io_uring_register_op_IORING_REGISTER_BUFFERS: io_uring_register_op = 0;
pub const io_uring_register_op_IORING_UNREGISTER_BUFFERS: io_uring_register_op = 1;
pub const io_uring_register_op_IORING_REGISTER_FILES: io_uring_register_op = 2;
pub const io_uring_register_op_IORING_UNREGISTER_FILES: io_uring_register_op = 3;
pub const io_uring_register_op_IORING_REGISTER_EVENTFD: io_uring_register_op = 4;
pub const io_uring_register_op_IORING_UNREGISTER_EVENTFD: io_uring_register_op = 5;
pub const io_uring_register_op_IORING_REGISTER_FILES_UPDATE: io_uring_register_op = 6;
pub const io_uring_register_op_IORING_REGISTER_EVENTFD_ASYNC: io_uring_register_op = 7;
pub const io_uring_register_op_IORING_REGISTER_PROBE: io_uring_register_op = 8;
pub const io_uring_register_op_IORING_REGISTER_PERSONALITY: io_uring_register_op = 9;
pub const io_uring_register_op_IORING_UNREGISTER_PERSONALITY: io_uring_register_op = 10;
pub const io_uring_register_op_IORING_REGISTER_RESTRICTIONS: io_uring_register_op = 11;
pub const io_uring_register_op_IORING_REGISTER_ENABLE_RINGS: io_uring_register_op = 12;
pub const io_uring_register_op_IORING_REGISTER_FILES2: io_uring_register_op = 13;
pub const io_uring_register_op_IORING_REGISTER_FILES_UPDATE2: io_uring_register_op = 14;
pub const io_uring_register_op_IORING_REGISTER_BUFFERS2: io_uring_register_op = 15;
pub const io_uring_register_op_IORING_REGISTER_BUFFERS_UPDATE: io_uring_register_op = 16;
pub const io_uring_register_op_IORING_REGISTER_IOWQ_AFF: io_uring_register_op = 17;
pub const io_uring_register_op_IORING_UNREGISTER_IOWQ_AFF: io_uring_register_op = 18;
pub const io_uring_register_op_IORING_REGISTER_IOWQ_MAX_WORKERS: io_uring_register_op = 19;
pub const io_uring_register_op_IORING_REGISTER_RING_FDS: io_uring_register_op = 20;
pub const io_uring_register_op_IORING_UNREGISTER_RING_FDS: io_uring_register_op = 21;
pub const io_uring_register_op_IORING_REGISTER_PBUF_RING: io_uring_register_op = 22;
pub const io_uring_register_op_IORING_UNREGISTER_PBUF_RING: io_uring_register_op = 23;
pub const io_uring_register_op_IORING_REGISTER_SYNC_CANCEL: io_uring_register_op = 24;
pub const io_uring_register_op_IORING_REGISTER_FILE_ALLOC_RANGE: io_uring_register_op = 25;
pub const io_uring_register_op_IORING_REGISTER_PBUF_STATUS: io_uring_register_op = 26;
pub const io_uring_register_op_IORING_REGISTER_NAPI: io_uring_register_op = 27;
pub const io_uring_register_op_IORING_UNREGISTER_NAPI: io_uring_register_op = 28;
pub const io_uring_register_op_IORING_REGISTER_CLOCK: io_uring_register_op = 29;
pub const io_uring_register_op_IORING_REGISTER_CLONE_BUFFERS: io_uring_register_op = 30;
pub const io_uring_register_op_IORING_REGISTER_RESIZE_RINGS: io_uring_register_op = 33;
pub const io_uring_register_op_IORING_REGISTER_MEM_REGION: io_uring_register_op = 34;
pub const io_uring_register_op_IORING_REGISTER_LAST: io_uring_register_op = 35;
pub const io_uring_register_op_IORING_REGISTER_USE_REGISTERED_RING: io_uring_register_op =
    2147483648;
pub type io_uring_register_op = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_files_update {
    pub offset: __u32,
    pub resv: __u32,
    pub fds: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_files_update"][::std::mem::size_of::<io_uring_files_update>() - 16usize];
    ["Alignment of io_uring_files_update"]
        [::std::mem::align_of::<io_uring_files_update>() - 8usize];
    ["Offset of field: io_uring_files_update::offset"]
        [::std::mem::offset_of!(io_uring_files_update, offset) - 0usize];
    ["Offset of field: io_uring_files_update::resv"]
        [::std::mem::offset_of!(io_uring_files_update, resv) - 4usize];
    ["Offset of field: io_uring_files_update::fds"]
        [::std::mem::offset_of!(io_uring_files_update, fds) - 8usize];
};
pub const IORING_MEM_REGION_TYPE_USER: _bindgen_ty_13 = 1;
pub type _bindgen_ty_13 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_region_desc {
    pub user_addr: __u64,
    pub size: __u64,
    pub flags: __u32,
    pub id: __u32,
    pub mmap_offset: __u64,
    pub __resv: [__u64; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_region_desc"][::std::mem::size_of::<io_uring_region_desc>() - 64usize];
    ["Alignment of io_uring_region_desc"][::std::mem::align_of::<io_uring_region_desc>() - 8usize];
    ["Offset of field: io_uring_region_desc::user_addr"]
        [::std::mem::offset_of!(io_uring_region_desc, user_addr) - 0usize];
    ["Offset of field: io_uring_region_desc::size"]
        [::std::mem::offset_of!(io_uring_region_desc, size) - 8usize];
    ["Offset of field: io_uring_region_desc::flags"]
        [::std::mem::offset_of!(io_uring_region_desc, flags) - 16usize];
    ["Offset of field: io_uring_region_desc::id"]
        [::std::mem::offset_of!(io_uring_region_desc, id) - 20usize];
    ["Offset of field: io_uring_region_desc::mmap_offset"]
        [::std::mem::offset_of!(io_uring_region_desc, mmap_offset) - 24usize];
    ["Offset of field: io_uring_region_desc::__resv"]
        [::std::mem::offset_of!(io_uring_region_desc, __resv) - 32usize];
};
pub const IORING_MEM_REGION_REG_WAIT_ARG: _bindgen_ty_14 = 1;
pub type _bindgen_ty_14 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_mem_region_reg {
    pub region_uptr: __u64,
    pub flags: __u64,
    pub __resv: [__u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_mem_region_reg"][::std::mem::size_of::<io_uring_mem_region_reg>() - 32usize];
    ["Alignment of io_uring_mem_region_reg"]
        [::std::mem::align_of::<io_uring_mem_region_reg>() - 8usize];
    ["Offset of field: io_uring_mem_region_reg::region_uptr"]
        [::std::mem::offset_of!(io_uring_mem_region_reg, region_uptr) - 0usize];
    ["Offset of field: io_uring_mem_region_reg::flags"]
        [::std::mem::offset_of!(io_uring_mem_region_reg, flags) - 8usize];
    ["Offset of field: io_uring_mem_region_reg::__resv"]
        [::std::mem::offset_of!(io_uring_mem_region_reg, __resv) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_rsrc_register {
    pub nr: __u32,
    pub flags: __u32,
    pub resv2: __u64,
    pub data: __u64,
    pub tags: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_rsrc_register"][::std::mem::size_of::<io_uring_rsrc_register>() - 32usize];
    ["Alignment of io_uring_rsrc_register"]
        [::std::mem::align_of::<io_uring_rsrc_register>() - 8usize];
    ["Offset of field: io_uring_rsrc_register::nr"]
        [::std::mem::offset_of!(io_uring_rsrc_register, nr) - 0usize];
    ["Offset of field: io_uring_rsrc_register::flags"]
        [::std::mem::offset_of!(io_uring_rsrc_register, flags) - 4usize];
    ["Offset of field: io_uring_rsrc_register::resv2"]
        [::std::mem::offset_of!(io_uring_rsrc_register, resv2) - 8usize];
    ["Offset of field: io_uring_rsrc_register::data"]
        [::std::mem::offset_of!(io_uring_rsrc_register, data) - 16usize];
    ["Offset of field: io_uring_rsrc_register::tags"]
        [::std::mem::offset_of!(io_uring_rsrc_register, tags) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_rsrc_update {
    pub offset: __u32,
    pub resv: __u32,
    pub data: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_rsrc_update"][::std::mem::size_of::<io_uring_rsrc_update>() - 16usize];
    ["Alignment of io_uring_rsrc_update"][::std::mem::align_of::<io_uring_rsrc_update>() - 8usize];
    ["Offset of field: io_uring_rsrc_update::offset"]
        [::std::mem::offset_of!(io_uring_rsrc_update, offset) - 0usize];
    ["Offset of field: io_uring_rsrc_update::resv"]
        [::std::mem::offset_of!(io_uring_rsrc_update, resv) - 4usize];
    ["Offset of field: io_uring_rsrc_update::data"]
        [::std::mem::offset_of!(io_uring_rsrc_update, data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_rsrc_update2 {
    pub offset: __u32,
    pub resv: __u32,
    pub data: __u64,
    pub tags: __u64,
    pub nr: __u32,
    pub resv2: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_rsrc_update2"][::std::mem::size_of::<io_uring_rsrc_update2>() - 32usize];
    ["Alignment of io_uring_rsrc_update2"]
        [::std::mem::align_of::<io_uring_rsrc_update2>() - 8usize];
    ["Offset of field: io_uring_rsrc_update2::offset"]
        [::std::mem::offset_of!(io_uring_rsrc_update2, offset) - 0usize];
    ["Offset of field: io_uring_rsrc_update2::resv"]
        [::std::mem::offset_of!(io_uring_rsrc_update2, resv) - 4usize];
    ["Offset of field: io_uring_rsrc_update2::data"]
        [::std::mem::offset_of!(io_uring_rsrc_update2, data) - 8usize];
    ["Offset of field: io_uring_rsrc_update2::tags"]
        [::std::mem::offset_of!(io_uring_rsrc_update2, tags) - 16usize];
    ["Offset of field: io_uring_rsrc_update2::nr"]
        [::std::mem::offset_of!(io_uring_rsrc_update2, nr) - 24usize];
    ["Offset of field: io_uring_rsrc_update2::resv2"]
        [::std::mem::offset_of!(io_uring_rsrc_update2, resv2) - 28usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_probe_op {
    pub op: __u8,
    pub resv: __u8,
    pub flags: __u16,
    pub resv2: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_probe_op"][::std::mem::size_of::<io_uring_probe_op>() - 8usize];
    ["Alignment of io_uring_probe_op"][::std::mem::align_of::<io_uring_probe_op>() - 4usize];
    ["Offset of field: io_uring_probe_op::op"]
        [::std::mem::offset_of!(io_uring_probe_op, op) - 0usize];
    ["Offset of field: io_uring_probe_op::resv"]
        [::std::mem::offset_of!(io_uring_probe_op, resv) - 1usize];
    ["Offset of field: io_uring_probe_op::flags"]
        [::std::mem::offset_of!(io_uring_probe_op, flags) - 2usize];
    ["Offset of field: io_uring_probe_op::resv2"]
        [::std::mem::offset_of!(io_uring_probe_op, resv2) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct io_uring_probe {
    pub last_op: __u8,
    pub ops_len: __u8,
    pub resv: __u16,
    pub resv2: [__u32; 3usize],
    pub ops: __IncompleteArrayField<io_uring_probe_op>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_probe"][::std::mem::size_of::<io_uring_probe>() - 16usize];
    ["Alignment of io_uring_probe"][::std::mem::align_of::<io_uring_probe>() - 4usize];
    ["Offset of field: io_uring_probe::last_op"]
        [::std::mem::offset_of!(io_uring_probe, last_op) - 0usize];
    ["Offset of field: io_uring_probe::ops_len"]
        [::std::mem::offset_of!(io_uring_probe, ops_len) - 1usize];
    ["Offset of field: io_uring_probe::resv"]
        [::std::mem::offset_of!(io_uring_probe, resv) - 2usize];
    ["Offset of field: io_uring_probe::resv2"]
        [::std::mem::offset_of!(io_uring_probe, resv2) - 4usize];
    ["Offset of field: io_uring_probe::ops"][::std::mem::offset_of!(io_uring_probe, ops) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct io_uring_restriction {
    pub opcode: __u16,
    pub __bindgen_anon_1: io_uring_restriction__bindgen_ty_1,
    pub resv: __u8,
    pub resv2: [__u32; 3usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union io_uring_restriction__bindgen_ty_1 {
    pub register_op: __u8,
    pub sqe_op: __u8,
    pub sqe_flags: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_restriction__bindgen_ty_1"]
        [::std::mem::size_of::<io_uring_restriction__bindgen_ty_1>() - 1usize];
    ["Alignment of io_uring_restriction__bindgen_ty_1"]
        [::std::mem::align_of::<io_uring_restriction__bindgen_ty_1>() - 1usize];
    ["Offset of field: io_uring_restriction__bindgen_ty_1::register_op"]
        [::std::mem::offset_of!(io_uring_restriction__bindgen_ty_1, register_op) - 0usize];
    ["Offset of field: io_uring_restriction__bindgen_ty_1::sqe_op"]
        [::std::mem::offset_of!(io_uring_restriction__bindgen_ty_1, sqe_op) - 0usize];
    ["Offset of field: io_uring_restriction__bindgen_ty_1::sqe_flags"]
        [::std::mem::offset_of!(io_uring_restriction__bindgen_ty_1, sqe_flags) - 0usize];
};
impl Default for io_uring_restriction__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_restriction"][::std::mem::size_of::<io_uring_restriction>() - 16usize];
    ["Alignment of io_uring_restriction"][::std::mem::align_of::<io_uring_restriction>() - 4usize];
    ["Offset of field: io_uring_restriction::opcode"]
        [::std::mem::offset_of!(io_uring_restriction, opcode) - 0usize];
    ["Offset of field: io_uring_restriction::resv"]
        [::std::mem::offset_of!(io_uring_restriction, resv) - 3usize];
    ["Offset of field: io_uring_restriction::resv2"]
        [::std::mem::offset_of!(io_uring_restriction, resv2) - 4usize];
};
impl Default for io_uring_restriction {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_clock_register {
    pub clockid: __u32,
    pub __resv: [__u32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_clock_register"][::std::mem::size_of::<io_uring_clock_register>() - 16usize];
    ["Alignment of io_uring_clock_register"]
        [::std::mem::align_of::<io_uring_clock_register>() - 4usize];
    ["Offset of field: io_uring_clock_register::clockid"]
        [::std::mem::offset_of!(io_uring_clock_register, clockid) - 0usize];
    ["Offset of field: io_uring_clock_register::__resv"]
        [::std::mem::offset_of!(io_uring_clock_register, __resv) - 4usize];
};
pub const IORING_REGISTER_SRC_REGISTERED: _bindgen_ty_15 = 1;
pub const IORING_REGISTER_DST_REPLACE: _bindgen_ty_15 = 2;
pub type _bindgen_ty_15 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_clone_buffers {
    pub src_fd: __u32,
    pub flags: __u32,
    pub src_off: __u32,
    pub dst_off: __u32,
    pub nr: __u32,
    pub pad: [__u32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_clone_buffers"][::std::mem::size_of::<io_uring_clone_buffers>() - 32usize];
    ["Alignment of io_uring_clone_buffers"]
        [::std::mem::align_of::<io_uring_clone_buffers>() - 4usize];
    ["Offset of field: io_uring_clone_buffers::src_fd"]
        [::std::mem::offset_of!(io_uring_clone_buffers, src_fd) - 0usize];
    ["Offset of field: io_uring_clone_buffers::flags"]
        [::std::mem::offset_of!(io_uring_clone_buffers, flags) - 4usize];
    ["Offset of field: io_uring_clone_buffers::src_off"]
        [::std::mem::offset_of!(io_uring_clone_buffers, src_off) - 8usize];
    ["Offset of field: io_uring_clone_buffers::dst_off"]
        [::std::mem::offset_of!(io_uring_clone_buffers, dst_off) - 12usize];
    ["Offset of field: io_uring_clone_buffers::nr"]
        [::std::mem::offset_of!(io_uring_clone_buffers, nr) - 16usize];
    ["Offset of field: io_uring_clone_buffers::pad"]
        [::std::mem::offset_of!(io_uring_clone_buffers, pad) - 20usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_buf {
    pub addr: __u64,
    pub len: __u32,
    pub bid: __u16,
    pub resv: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_buf"][::std::mem::size_of::<io_uring_buf>() - 16usize];
    ["Alignment of io_uring_buf"][::std::mem::align_of::<io_uring_buf>() - 8usize];
    ["Offset of field: io_uring_buf::addr"][::std::mem::offset_of!(io_uring_buf, addr) - 0usize];
    ["Offset of field: io_uring_buf::len"][::std::mem::offset_of!(io_uring_buf, len) - 8usize];
    ["Offset of field: io_uring_buf::bid"][::std::mem::offset_of!(io_uring_buf, bid) - 12usize];
    ["Offset of field: io_uring_buf::resv"][::std::mem::offset_of!(io_uring_buf, resv) - 14usize];
};
#[repr(C)]
pub struct io_uring_buf_ring {
    pub __bindgen_anon_1: io_uring_buf_ring__bindgen_ty_1,
}
#[repr(C)]
pub struct io_uring_buf_ring__bindgen_ty_1 {
    pub __bindgen_anon_1: __BindgenUnionField<io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1>,
    pub bufs: __BindgenUnionField<[io_uring_buf; 0usize]>,
    pub bindgen_union_field: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1 {
    pub resv1: __u64,
    pub resv2: __u32,
    pub resv3: __u16,
    pub tail: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    ["Alignment of io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1::resv1"]
        [::std::mem::offset_of!(io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1, resv1) - 0usize];
    ["Offset of field: io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1::resv2"]
        [::std::mem::offset_of!(io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1, resv2) - 8usize];
    ["Offset of field: io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1::resv3"]
        [::std::mem::offset_of!(io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1, resv3) - 12usize];
    ["Offset of field: io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1::tail"]
        [::std::mem::offset_of!(io_uring_buf_ring__bindgen_ty_1__bindgen_ty_1, tail) - 14usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_buf_ring__bindgen_ty_1"]
        [::std::mem::size_of::<io_uring_buf_ring__bindgen_ty_1>() - 16usize];
    ["Alignment of io_uring_buf_ring__bindgen_ty_1"]
        [::std::mem::align_of::<io_uring_buf_ring__bindgen_ty_1>() - 8usize];
    ["Offset of field: io_uring_buf_ring__bindgen_ty_1::bufs"]
        [::std::mem::offset_of!(io_uring_buf_ring__bindgen_ty_1, bufs) - 0usize];
};
impl Default for io_uring_buf_ring__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_buf_ring"][::std::mem::size_of::<io_uring_buf_ring>() - 16usize];
    ["Alignment of io_uring_buf_ring"][::std::mem::align_of::<io_uring_buf_ring>() - 8usize];
};
impl Default for io_uring_buf_ring {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const io_uring_register_pbuf_ring_flags_IOU_PBUF_RING_MMAP: io_uring_register_pbuf_ring_flags =
    1;
pub const io_uring_register_pbuf_ring_flags_IOU_PBUF_RING_INC: io_uring_register_pbuf_ring_flags =
    2;
pub type io_uring_register_pbuf_ring_flags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_buf_reg {
    pub ring_addr: __u64,
    pub ring_entries: __u32,
    pub bgid: __u16,
    pub flags: __u16,
    pub resv: [__u64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_buf_reg"][::std::mem::size_of::<io_uring_buf_reg>() - 40usize];
    ["Alignment of io_uring_buf_reg"][::std::mem::align_of::<io_uring_buf_reg>() - 8usize];
    ["Offset of field: io_uring_buf_reg::ring_addr"]
        [::std::mem::offset_of!(io_uring_buf_reg, ring_addr) - 0usize];
    ["Offset of field: io_uring_buf_reg::ring_entries"]
        [::std::mem::offset_of!(io_uring_buf_reg, ring_entries) - 8usize];
    ["Offset of field: io_uring_buf_reg::bgid"]
        [::std::mem::offset_of!(io_uring_buf_reg, bgid) - 12usize];
    ["Offset of field: io_uring_buf_reg::flags"]
        [::std::mem::offset_of!(io_uring_buf_reg, flags) - 14usize];
    ["Offset of field: io_uring_buf_reg::resv"]
        [::std::mem::offset_of!(io_uring_buf_reg, resv) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_buf_status {
    pub buf_group: __u32,
    pub head: __u32,
    pub resv: [__u32; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_buf_status"][::std::mem::size_of::<io_uring_buf_status>() - 40usize];
    ["Alignment of io_uring_buf_status"][::std::mem::align_of::<io_uring_buf_status>() - 4usize];
    ["Offset of field: io_uring_buf_status::buf_group"]
        [::std::mem::offset_of!(io_uring_buf_status, buf_group) - 0usize];
    ["Offset of field: io_uring_buf_status::head"]
        [::std::mem::offset_of!(io_uring_buf_status, head) - 4usize];
    ["Offset of field: io_uring_buf_status::resv"]
        [::std::mem::offset_of!(io_uring_buf_status, resv) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_napi {
    pub busy_poll_to: __u32,
    pub prefer_busy_poll: __u8,
    pub pad: [__u8; 3usize],
    pub resv: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_napi"][::std::mem::size_of::<io_uring_napi>() - 16usize];
    ["Alignment of io_uring_napi"][::std::mem::align_of::<io_uring_napi>() - 8usize];
    ["Offset of field: io_uring_napi::busy_poll_to"]
        [::std::mem::offset_of!(io_uring_napi, busy_poll_to) - 0usize];
    ["Offset of field: io_uring_napi::prefer_busy_poll"]
        [::std::mem::offset_of!(io_uring_napi, prefer_busy_poll) - 4usize];
    ["Offset of field: io_uring_napi::pad"][::std::mem::offset_of!(io_uring_napi, pad) - 5usize];
    ["Offset of field: io_uring_napi::resv"][::std::mem::offset_of!(io_uring_napi, resv) - 8usize];
};
pub const io_uring_register_restriction_op_IORING_RESTRICTION_REGISTER_OP:
    io_uring_register_restriction_op = 0;
pub const io_uring_register_restriction_op_IORING_RESTRICTION_SQE_OP:
    io_uring_register_restriction_op = 1;
pub const io_uring_register_restriction_op_IORING_RESTRICTION_SQE_FLAGS_ALLOWED:
    io_uring_register_restriction_op = 2;
pub const io_uring_register_restriction_op_IORING_RESTRICTION_SQE_FLAGS_REQUIRED:
    io_uring_register_restriction_op = 3;
pub const io_uring_register_restriction_op_IORING_RESTRICTION_LAST:
    io_uring_register_restriction_op = 4;
pub type io_uring_register_restriction_op = ::std::os::raw::c_uint;
pub const IORING_REG_WAIT_TS: _bindgen_ty_16 = 1;
pub type _bindgen_ty_16 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_cqwait_reg_arg {
    pub flags: __u32,
    pub struct_size: __u32,
    pub nr_entries: __u32,
    pub pad: __u32,
    pub user_addr: __u64,
    pub pad2: [__u64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_cqwait_reg_arg"][::std::mem::size_of::<io_uring_cqwait_reg_arg>() - 48usize];
    ["Alignment of io_uring_cqwait_reg_arg"]
        [::std::mem::align_of::<io_uring_cqwait_reg_arg>() - 8usize];
    ["Offset of field: io_uring_cqwait_reg_arg::flags"]
        [::std::mem::offset_of!(io_uring_cqwait_reg_arg, flags) - 0usize];
    ["Offset of field: io_uring_cqwait_reg_arg::struct_size"]
        [::std::mem::offset_of!(io_uring_cqwait_reg_arg, struct_size) - 4usize];
    ["Offset of field: io_uring_cqwait_reg_arg::nr_entries"]
        [::std::mem::offset_of!(io_uring_cqwait_reg_arg, nr_entries) - 8usize];
    ["Offset of field: io_uring_cqwait_reg_arg::pad"]
        [::std::mem::offset_of!(io_uring_cqwait_reg_arg, pad) - 12usize];
    ["Offset of field: io_uring_cqwait_reg_arg::user_addr"]
        [::std::mem::offset_of!(io_uring_cqwait_reg_arg, user_addr) - 16usize];
    ["Offset of field: io_uring_cqwait_reg_arg::pad2"]
        [::std::mem::offset_of!(io_uring_cqwait_reg_arg, pad2) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_reg_wait {
    pub ts: __kernel_timespec,
    pub min_wait_usec: __u32,
    pub flags: __u32,
    pub sigmask: __u64,
    pub sigmask_sz: __u32,
    pub pad: [__u32; 3usize],
    pub pad2: [__u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_reg_wait"][::std::mem::size_of::<io_uring_reg_wait>() - 64usize];
    ["Alignment of io_uring_reg_wait"][::std::mem::align_of::<io_uring_reg_wait>() - 8usize];
    ["Offset of field: io_uring_reg_wait::ts"]
        [::std::mem::offset_of!(io_uring_reg_wait, ts) - 0usize];
    ["Offset of field: io_uring_reg_wait::min_wait_usec"]
        [::std::mem::offset_of!(io_uring_reg_wait, min_wait_usec) - 16usize];
    ["Offset of field: io_uring_reg_wait::flags"]
        [::std::mem::offset_of!(io_uring_reg_wait, flags) - 20usize];
    ["Offset of field: io_uring_reg_wait::sigmask"]
        [::std::mem::offset_of!(io_uring_reg_wait, sigmask) - 24usize];
    ["Offset of field: io_uring_reg_wait::sigmask_sz"]
        [::std::mem::offset_of!(io_uring_reg_wait, sigmask_sz) - 32usize];
    ["Offset of field: io_uring_reg_wait::pad"]
        [::std::mem::offset_of!(io_uring_reg_wait, pad) - 36usize];
    ["Offset of field: io_uring_reg_wait::pad2"]
        [::std::mem::offset_of!(io_uring_reg_wait, pad2) - 48usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_getevents_arg {
    pub sigmask: __u64,
    pub sigmask_sz: __u32,
    pub min_wait_usec: __u32,
    pub ts: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_getevents_arg"][::std::mem::size_of::<io_uring_getevents_arg>() - 24usize];
    ["Alignment of io_uring_getevents_arg"]
        [::std::mem::align_of::<io_uring_getevents_arg>() - 8usize];
    ["Offset of field: io_uring_getevents_arg::sigmask"]
        [::std::mem::offset_of!(io_uring_getevents_arg, sigmask) - 0usize];
    ["Offset of field: io_uring_getevents_arg::sigmask_sz"]
        [::std::mem::offset_of!(io_uring_getevents_arg, sigmask_sz) - 8usize];
    ["Offset of field: io_uring_getevents_arg::min_wait_usec"]
        [::std::mem::offset_of!(io_uring_getevents_arg, min_wait_usec) - 12usize];
    ["Offset of field: io_uring_getevents_arg::ts"]
        [::std::mem::offset_of!(io_uring_getevents_arg, ts) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_sync_cancel_reg {
    pub addr: __u64,
    pub fd: __s32,
    pub flags: __u32,
    pub timeout: __kernel_timespec,
    pub opcode: __u8,
    pub pad: [__u8; 7usize],
    pub pad2: [__u64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sync_cancel_reg"]
        [::std::mem::size_of::<io_uring_sync_cancel_reg>() - 64usize];
    ["Alignment of io_uring_sync_cancel_reg"]
        [::std::mem::align_of::<io_uring_sync_cancel_reg>() - 8usize];
    ["Offset of field: io_uring_sync_cancel_reg::addr"]
        [::std::mem::offset_of!(io_uring_sync_cancel_reg, addr) - 0usize];
    ["Offset of field: io_uring_sync_cancel_reg::fd"]
        [::std::mem::offset_of!(io_uring_sync_cancel_reg, fd) - 8usize];
    ["Offset of field: io_uring_sync_cancel_reg::flags"]
        [::std::mem::offset_of!(io_uring_sync_cancel_reg, flags) - 12usize];
    ["Offset of field: io_uring_sync_cancel_reg::timeout"]
        [::std::mem::offset_of!(io_uring_sync_cancel_reg, timeout) - 16usize];
    ["Offset of field: io_uring_sync_cancel_reg::opcode"]
        [::std::mem::offset_of!(io_uring_sync_cancel_reg, opcode) - 32usize];
    ["Offset of field: io_uring_sync_cancel_reg::pad"]
        [::std::mem::offset_of!(io_uring_sync_cancel_reg, pad) - 33usize];
    ["Offset of field: io_uring_sync_cancel_reg::pad2"]
        [::std::mem::offset_of!(io_uring_sync_cancel_reg, pad2) - 40usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_file_index_range {
    pub off: __u32,
    pub len: __u32,
    pub resv: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_file_index_range"]
        [::std::mem::size_of::<io_uring_file_index_range>() - 16usize];
    ["Alignment of io_uring_file_index_range"]
        [::std::mem::align_of::<io_uring_file_index_range>() - 8usize];
    ["Offset of field: io_uring_file_index_range::off"]
        [::std::mem::offset_of!(io_uring_file_index_range, off) - 0usize];
    ["Offset of field: io_uring_file_index_range::len"]
        [::std::mem::offset_of!(io_uring_file_index_range, len) - 4usize];
    ["Offset of field: io_uring_file_index_range::resv"]
        [::std::mem::offset_of!(io_uring_file_index_range, resv) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct io_uring_recvmsg_out {
    pub namelen: __u32,
    pub controllen: __u32,
    pub payloadlen: __u32,
    pub flags: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_recvmsg_out"][::std::mem::size_of::<io_uring_recvmsg_out>() - 16usize];
    ["Alignment of io_uring_recvmsg_out"][::std::mem::align_of::<io_uring_recvmsg_out>() - 4usize];
    ["Offset of field: io_uring_recvmsg_out::namelen"]
        [::std::mem::offset_of!(io_uring_recvmsg_out, namelen) - 0usize];
    ["Offset of field: io_uring_recvmsg_out::controllen"]
        [::std::mem::offset_of!(io_uring_recvmsg_out, controllen) - 4usize];
    ["Offset of field: io_uring_recvmsg_out::payloadlen"]
        [::std::mem::offset_of!(io_uring_recvmsg_out, payloadlen) - 8usize];
    ["Offset of field: io_uring_recvmsg_out::flags"]
        [::std::mem::offset_of!(io_uring_recvmsg_out, flags) - 12usize];
};
pub const io_uring_socket_op_SOCKET_URING_OP_SIOCINQ: io_uring_socket_op = 0;
pub const io_uring_socket_op_SOCKET_URING_OP_SIOCOUTQ: io_uring_socket_op = 1;
pub const io_uring_socket_op_SOCKET_URING_OP_GETSOCKOPT: io_uring_socket_op = 2;
pub const io_uring_socket_op_SOCKET_URING_OP_SETSOCKOPT: io_uring_socket_op = 3;
pub type io_uring_socket_op = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct io_uring_sq {
    pub khead: *mut ::std::os::raw::c_uint,
    pub ktail: *mut ::std::os::raw::c_uint,
    pub kring_mask: *mut ::std::os::raw::c_uint,
    pub kring_entries: *mut ::std::os::raw::c_uint,
    pub kflags: *mut ::std::os::raw::c_uint,
    pub kdropped: *mut ::std::os::raw::c_uint,
    pub array: *mut ::std::os::raw::c_uint,
    pub sqes: *mut io_uring_sqe,
    pub sqe_head: ::std::os::raw::c_uint,
    pub sqe_tail: ::std::os::raw::c_uint,
    pub ring_sz: usize,
    pub ring_ptr: *mut ::std::os::raw::c_void,
    pub ring_mask: ::std::os::raw::c_uint,
    pub ring_entries: ::std::os::raw::c_uint,
    pub pad: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sq"][::std::mem::size_of::<io_uring_sq>() - 104usize];
    ["Alignment of io_uring_sq"][::std::mem::align_of::<io_uring_sq>() - 8usize];
    ["Offset of field: io_uring_sq::khead"][::std::mem::offset_of!(io_uring_sq, khead) - 0usize];
    ["Offset of field: io_uring_sq::ktail"][::std::mem::offset_of!(io_uring_sq, ktail) - 8usize];
    ["Offset of field: io_uring_sq::kring_mask"]
        [::std::mem::offset_of!(io_uring_sq, kring_mask) - 16usize];
    ["Offset of field: io_uring_sq::kring_entries"]
        [::std::mem::offset_of!(io_uring_sq, kring_entries) - 24usize];
    ["Offset of field: io_uring_sq::kflags"][::std::mem::offset_of!(io_uring_sq, kflags) - 32usize];
    ["Offset of field: io_uring_sq::kdropped"]
        [::std::mem::offset_of!(io_uring_sq, kdropped) - 40usize];
    ["Offset of field: io_uring_sq::array"][::std::mem::offset_of!(io_uring_sq, array) - 48usize];
    ["Offset of field: io_uring_sq::sqes"][::std::mem::offset_of!(io_uring_sq, sqes) - 56usize];
    ["Offset of field: io_uring_sq::sqe_head"]
        [::std::mem::offset_of!(io_uring_sq, sqe_head) - 64usize];
    ["Offset of field: io_uring_sq::sqe_tail"]
        [::std::mem::offset_of!(io_uring_sq, sqe_tail) - 68usize];
    ["Offset of field: io_uring_sq::ring_sz"]
        [::std::mem::offset_of!(io_uring_sq, ring_sz) - 72usize];
    ["Offset of field: io_uring_sq::ring_ptr"]
        [::std::mem::offset_of!(io_uring_sq, ring_ptr) - 80usize];
    ["Offset of field: io_uring_sq::ring_mask"]
        [::std::mem::offset_of!(io_uring_sq, ring_mask) - 88usize];
    ["Offset of field: io_uring_sq::ring_entries"]
        [::std::mem::offset_of!(io_uring_sq, ring_entries) - 92usize];
    ["Offset of field: io_uring_sq::pad"][::std::mem::offset_of!(io_uring_sq, pad) - 96usize];
};
impl Default for io_uring_sq {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct io_uring_cq {
    pub khead: *mut ::std::os::raw::c_uint,
    pub ktail: *mut ::std::os::raw::c_uint,
    pub kring_mask: *mut ::std::os::raw::c_uint,
    pub kring_entries: *mut ::std::os::raw::c_uint,
    pub kflags: *mut ::std::os::raw::c_uint,
    pub koverflow: *mut ::std::os::raw::c_uint,
    pub cqes: *mut io_uring_cqe,
    pub ring_sz: usize,
    pub ring_ptr: *mut ::std::os::raw::c_void,
    pub ring_mask: ::std::os::raw::c_uint,
    pub ring_entries: ::std::os::raw::c_uint,
    pub pad: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_cq"][::std::mem::size_of::<io_uring_cq>() - 88usize];
    ["Alignment of io_uring_cq"][::std::mem::align_of::<io_uring_cq>() - 8usize];
    ["Offset of field: io_uring_cq::khead"][::std::mem::offset_of!(io_uring_cq, khead) - 0usize];
    ["Offset of field: io_uring_cq::ktail"][::std::mem::offset_of!(io_uring_cq, ktail) - 8usize];
    ["Offset of field: io_uring_cq::kring_mask"]
        [::std::mem::offset_of!(io_uring_cq, kring_mask) - 16usize];
    ["Offset of field: io_uring_cq::kring_entries"]
        [::std::mem::offset_of!(io_uring_cq, kring_entries) - 24usize];
    ["Offset of field: io_uring_cq::kflags"][::std::mem::offset_of!(io_uring_cq, kflags) - 32usize];
    ["Offset of field: io_uring_cq::koverflow"]
        [::std::mem::offset_of!(io_uring_cq, koverflow) - 40usize];
    ["Offset of field: io_uring_cq::cqes"][::std::mem::offset_of!(io_uring_cq, cqes) - 48usize];
    ["Offset of field: io_uring_cq::ring_sz"]
        [::std::mem::offset_of!(io_uring_cq, ring_sz) - 56usize];
    ["Offset of field: io_uring_cq::ring_ptr"]
        [::std::mem::offset_of!(io_uring_cq, ring_ptr) - 64usize];
    ["Offset of field: io_uring_cq::ring_mask"]
        [::std::mem::offset_of!(io_uring_cq, ring_mask) - 72usize];
    ["Offset of field: io_uring_cq::ring_entries"]
        [::std::mem::offset_of!(io_uring_cq, ring_entries) - 76usize];
    ["Offset of field: io_uring_cq::pad"][::std::mem::offset_of!(io_uring_cq, pad) - 80usize];
};
impl Default for io_uring_cq {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct io_uring {
    pub sq: io_uring_sq,
    pub cq: io_uring_cq,
    pub flags: ::std::os::raw::c_uint,
    pub ring_fd: ::std::os::raw::c_int,
    pub features: ::std::os::raw::c_uint,
    pub enter_ring_fd: ::std::os::raw::c_int,
    pub int_flags: __u8,
    pub pad: [__u8; 3usize],
    pub pad2: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring"][::std::mem::size_of::<io_uring>() - 216usize];
    ["Alignment of io_uring"][::std::mem::align_of::<io_uring>() - 8usize];
    ["Offset of field: io_uring::sq"][::std::mem::offset_of!(io_uring, sq) - 0usize];
    ["Offset of field: io_uring::cq"][::std::mem::offset_of!(io_uring, cq) - 104usize];
    ["Offset of field: io_uring::flags"][::std::mem::offset_of!(io_uring, flags) - 192usize];
    ["Offset of field: io_uring::ring_fd"][::std::mem::offset_of!(io_uring, ring_fd) - 196usize];
    ["Offset of field: io_uring::features"][::std::mem::offset_of!(io_uring, features) - 200usize];
    ["Offset of field: io_uring::enter_ring_fd"]
        [::std::mem::offset_of!(io_uring, enter_ring_fd) - 204usize];
    ["Offset of field: io_uring::int_flags"]
        [::std::mem::offset_of!(io_uring, int_flags) - 208usize];
    ["Offset of field: io_uring::pad"][::std::mem::offset_of!(io_uring, pad) - 209usize];
    ["Offset of field: io_uring::pad2"][::std::mem::offset_of!(io_uring, pad2) - 212usize];
};
impl Default for io_uring {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn io_uring_get_probe_ring(ring: *mut io_uring) -> *mut io_uring_probe;
}
extern "C" {
    pub fn io_uring_get_probe() -> *mut io_uring_probe;
}
extern "C" {
    pub fn io_uring_free_probe(probe: *mut io_uring_probe);
}
extern "C" {
    pub fn io_uring_opcode_supported(
        p: *const io_uring_probe,
        op: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_queue_init_mem(
        entries: ::std::os::raw::c_uint,
        ring: *mut io_uring,
        p: *mut io_uring_params,
        buf: *mut ::std::os::raw::c_void,
        buf_size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_queue_init_params(
        entries: ::std::os::raw::c_uint,
        ring: *mut io_uring,
        p: *mut io_uring_params,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_queue_init(
        entries: ::std::os::raw::c_uint,
        ring: *mut io_uring,
        flags: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_queue_mmap(
        fd: ::std::os::raw::c_int,
        p: *mut io_uring_params,
        ring: *mut io_uring,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_ring_dontfork(ring: *mut io_uring) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_queue_exit(ring: *mut io_uring);
}
extern "C" {
    pub fn io_uring_peek_batch_cqe(
        ring: *mut io_uring,
        cqes: *mut *mut io_uring_cqe,
        count: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn io_uring_wait_cqes(
        ring: *mut io_uring,
        cqe_ptr: *mut *mut io_uring_cqe,
        wait_nr: ::std::os::raw::c_uint,
        ts: *mut __kernel_timespec,
        sigmask: *mut sigset_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_wait_cqes_min_timeout(
        ring: *mut io_uring,
        cqe_ptr: *mut *mut io_uring_cqe,
        wait_nr: ::std::os::raw::c_uint,
        ts: *mut __kernel_timespec,
        min_ts_usec: ::std::os::raw::c_uint,
        sigmask: *mut sigset_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_wait_cqe_timeout(
        ring: *mut io_uring,
        cqe_ptr: *mut *mut io_uring_cqe,
        ts: *mut __kernel_timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_submit(ring: *mut io_uring) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_submit_and_wait(
        ring: *mut io_uring,
        wait_nr: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_submit_and_wait_timeout(
        ring: *mut io_uring,
        cqe_ptr: *mut *mut io_uring_cqe,
        wait_nr: ::std::os::raw::c_uint,
        ts: *mut __kernel_timespec,
        sigmask: *mut sigset_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_submit_and_wait_min_timeout(
        ring: *mut io_uring,
        cqe_ptr: *mut *mut io_uring_cqe,
        wait_nr: ::std::os::raw::c_uint,
        ts: *mut __kernel_timespec,
        min_wait: ::std::os::raw::c_uint,
        sigmask: *mut sigset_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_submit_and_wait_reg(
        ring: *mut io_uring,
        cqe_ptr: *mut *mut io_uring_cqe,
        wait_nr: ::std::os::raw::c_uint,
        reg_index: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_wait_reg(
        ring: *mut io_uring,
        reg: *mut io_uring_reg_wait,
        nr: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_resize_rings(
        ring: *mut io_uring,
        p: *mut io_uring_params,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_clone_buffers_offset(
        dst: *mut io_uring,
        src: *mut io_uring,
        dst_off: ::std::os::raw::c_uint,
        src_off: ::std::os::raw::c_uint,
        nr: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_clone_buffers(dst: *mut io_uring, src: *mut io_uring) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_buffers(
        ring: *mut io_uring,
        iovecs: *const iovec,
        nr_iovecs: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_buffers_tags(
        ring: *mut io_uring,
        iovecs: *const iovec,
        tags: *const __u64,
        nr: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_buffers_sparse(
        ring: *mut io_uring,
        nr: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_buffers_update_tag(
        ring: *mut io_uring,
        off: ::std::os::raw::c_uint,
        iovecs: *const iovec,
        tags: *const __u64,
        nr: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_unregister_buffers(ring: *mut io_uring) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_files(
        ring: *mut io_uring,
        files: *const ::std::os::raw::c_int,
        nr_files: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_files_tags(
        ring: *mut io_uring,
        files: *const ::std::os::raw::c_int,
        tags: *const __u64,
        nr: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_files_sparse(
        ring: *mut io_uring,
        nr: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_files_update_tag(
        ring: *mut io_uring,
        off: ::std::os::raw::c_uint,
        files: *const ::std::os::raw::c_int,
        tags: *const __u64,
        nr_files: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_unregister_files(ring: *mut io_uring) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_files_update(
        ring: *mut io_uring,
        off: ::std::os::raw::c_uint,
        files: *const ::std::os::raw::c_int,
        nr_files: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_eventfd(
        ring: *mut io_uring,
        fd: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_eventfd_async(
        ring: *mut io_uring,
        fd: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_unregister_eventfd(ring: *mut io_uring) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_probe(
        ring: *mut io_uring,
        p: *mut io_uring_probe,
        nr: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_personality(ring: *mut io_uring) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_unregister_personality(
        ring: *mut io_uring,
        id: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_restrictions(
        ring: *mut io_uring,
        res: *mut io_uring_restriction,
        nr_res: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_enable_rings(ring: *mut io_uring) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_unregister_iowq_aff(ring: *mut io_uring) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_iowq_max_workers(
        ring: *mut io_uring,
        values: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_ring_fd(ring: *mut io_uring) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_unregister_ring_fd(ring: *mut io_uring) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_close_ring_fd(ring: *mut io_uring) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_buf_ring(
        ring: *mut io_uring,
        reg: *mut io_uring_buf_reg,
        flags: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_unregister_buf_ring(
        ring: *mut io_uring,
        bgid: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_buf_ring_head(
        ring: *mut io_uring,
        buf_group: ::std::os::raw::c_int,
        head: *mut u16,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_sync_cancel(
        ring: *mut io_uring,
        reg: *mut io_uring_sync_cancel_reg,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_file_alloc_range(
        ring: *mut io_uring,
        off: ::std::os::raw::c_uint,
        len: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_napi(
        ring: *mut io_uring,
        napi: *mut io_uring_napi,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_unregister_napi(
        ring: *mut io_uring,
        napi: *mut io_uring_napi,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_clock(
        ring: *mut io_uring,
        arg: *mut io_uring_clock_register,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_get_events(ring: *mut io_uring) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_submit_and_get_events(ring: *mut io_uring) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_enter(
        fd: ::std::os::raw::c_uint,
        to_submit: ::std::os::raw::c_uint,
        min_complete: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
        sig: *mut sigset_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_enter2(
        fd: ::std::os::raw::c_uint,
        to_submit: ::std::os::raw::c_uint,
        min_complete: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
        sig: *mut sigset_t,
        sz: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_setup(
        entries: ::std::os::raw::c_uint,
        p: *mut io_uring_params,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register(
        fd: ::std::os::raw::c_uint,
        opcode: ::std::os::raw::c_uint,
        arg: *const ::std::os::raw::c_void,
        nr_args: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_register_region(
        ring: *mut io_uring,
        reg: *mut io_uring_mem_region_reg,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_setup_buf_ring(
        ring: *mut io_uring,
        nentries: ::std::os::raw::c_uint,
        bgid: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_uint,
        err: *mut ::std::os::raw::c_int,
    ) -> *mut io_uring_buf_ring;
}
extern "C" {
    pub fn io_uring_free_buf_ring(
        ring: *mut io_uring,
        br: *mut io_uring_buf_ring,
        nentries: ::std::os::raw::c_uint,
        bgid: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_cq_advance(ring: *mut io_uring, nr: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn io_uring_cqe_seen(ring: *mut io_uring, cqe: *mut io_uring_cqe);
}
extern "C" {
    pub fn io_uring_sqe_set_data(sqe: *mut io_uring_sqe, data: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn io_uring_cqe_get_data(cqe: *const io_uring_cqe) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn io_uring_sqe_set_data64(sqe: *mut io_uring_sqe, data: __u64);
}
extern "C" {
    pub fn io_uring_cqe_get_data64(cqe: *const io_uring_cqe) -> __u64;
}
extern "C" {
    pub fn io_uring_sqe_set_flags(sqe: *mut io_uring_sqe, flags: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn io_uring_sqe_set_buf_group(sqe: *mut io_uring_sqe, bgid: ::std::os::raw::c_int);
}
extern "C" {
    pub fn io_uring_initialize_sqe(sqe: *mut io_uring_sqe);
}
extern "C" {
    pub fn io_uring_prep_rw(
        op: ::std::os::raw::c_int,
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        addr: *const ::std::os::raw::c_void,
        len: ::std::os::raw::c_uint,
        offset: __u64,
    );
}
extern "C" {
    pub fn io_uring_prep_splice(
        sqe: *mut io_uring_sqe,
        fd_in: ::std::os::raw::c_int,
        off_in: i64,
        fd_out: ::std::os::raw::c_int,
        off_out: i64,
        nbytes: ::std::os::raw::c_uint,
        splice_flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_tee(
        sqe: *mut io_uring_sqe,
        fd_in: ::std::os::raw::c_int,
        fd_out: ::std::os::raw::c_int,
        nbytes: ::std::os::raw::c_uint,
        splice_flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_readv(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        iovecs: *const iovec,
        nr_vecs: ::std::os::raw::c_uint,
        offset: __u64,
    );
}
extern "C" {
    pub fn io_uring_prep_readv2(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        iovecs: *const iovec,
        nr_vecs: ::std::os::raw::c_uint,
        offset: __u64,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_read_fixed(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        buf: *mut ::std::os::raw::c_void,
        nbytes: ::std::os::raw::c_uint,
        offset: __u64,
        buf_index: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_writev(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        iovecs: *const iovec,
        nr_vecs: ::std::os::raw::c_uint,
        offset: __u64,
    );
}
extern "C" {
    pub fn io_uring_prep_writev2(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        iovecs: *const iovec,
        nr_vecs: ::std::os::raw::c_uint,
        offset: __u64,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_write_fixed(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        buf: *const ::std::os::raw::c_void,
        nbytes: ::std::os::raw::c_uint,
        offset: __u64,
        buf_index: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_recvmsg(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        msg: *mut msghdr,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_recvmsg_multishot(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        msg: *mut msghdr,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_sendmsg(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        msg: *const msghdr,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_poll_add(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        poll_mask: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_poll_multishot(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        poll_mask: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_poll_remove(sqe: *mut io_uring_sqe, user_data: __u64);
}
extern "C" {
    pub fn io_uring_prep_poll_update(
        sqe: *mut io_uring_sqe,
        old_user_data: __u64,
        new_user_data: __u64,
        poll_mask: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_fsync(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        fsync_flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_nop(sqe: *mut io_uring_sqe);
}
extern "C" {
    pub fn io_uring_prep_timeout(
        sqe: *mut io_uring_sqe,
        ts: *mut __kernel_timespec,
        count: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_timeout_remove(
        sqe: *mut io_uring_sqe,
        user_data: __u64,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_timeout_update(
        sqe: *mut io_uring_sqe,
        ts: *mut __kernel_timespec,
        user_data: __u64,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_accept(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        addr: *mut sockaddr,
        addrlen: *mut socklen_t,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_accept_direct(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        addr: *mut sockaddr,
        addrlen: *mut socklen_t,
        flags: ::std::os::raw::c_int,
        file_index: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_multishot_accept(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        addr: *mut sockaddr,
        addrlen: *mut socklen_t,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_multishot_accept_direct(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        addr: *mut sockaddr,
        addrlen: *mut socklen_t,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_cancel64(
        sqe: *mut io_uring_sqe,
        user_data: __u64,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_cancel(
        sqe: *mut io_uring_sqe,
        user_data: *mut ::std::os::raw::c_void,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_cancel_fd(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_link_timeout(
        sqe: *mut io_uring_sqe,
        ts: *mut __kernel_timespec,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_connect(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        addr: *const sockaddr,
        addrlen: socklen_t,
    );
}
extern "C" {
    pub fn io_uring_prep_bind(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        addr: *mut sockaddr,
        addrlen: socklen_t,
    );
}
extern "C" {
    pub fn io_uring_prep_listen(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        backlog: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_files_update(
        sqe: *mut io_uring_sqe,
        fds: *mut ::std::os::raw::c_int,
        nr_fds: ::std::os::raw::c_uint,
        offset: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_fallocate(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        mode: ::std::os::raw::c_int,
        offset: __u64,
        len: __u64,
    );
}
extern "C" {
    pub fn io_uring_prep_openat(
        sqe: *mut io_uring_sqe,
        dfd: ::std::os::raw::c_int,
        path: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        mode: mode_t,
    );
}
extern "C" {
    pub fn io_uring_prep_openat_direct(
        sqe: *mut io_uring_sqe,
        dfd: ::std::os::raw::c_int,
        path: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        mode: mode_t,
        file_index: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_open(
        sqe: *mut io_uring_sqe,
        path: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        mode: mode_t,
    );
}
extern "C" {
    pub fn io_uring_prep_open_direct(
        sqe: *mut io_uring_sqe,
        path: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        mode: mode_t,
        file_index: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_close(sqe: *mut io_uring_sqe, fd: ::std::os::raw::c_int);
}
extern "C" {
    pub fn io_uring_prep_close_direct(sqe: *mut io_uring_sqe, file_index: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn io_uring_prep_read(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        buf: *mut ::std::os::raw::c_void,
        nbytes: ::std::os::raw::c_uint,
        offset: __u64,
    );
}
extern "C" {
    pub fn io_uring_prep_read_multishot(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        nbytes: ::std::os::raw::c_uint,
        offset: __u64,
        buf_group: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_write(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        buf: *const ::std::os::raw::c_void,
        nbytes: ::std::os::raw::c_uint,
        offset: __u64,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct statx {
    _unused: [u8; 0],
}
extern "C" {
    pub fn io_uring_prep_statx(
        sqe: *mut io_uring_sqe,
        dfd: ::std::os::raw::c_int,
        path: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        mask: ::std::os::raw::c_uint,
        statxbuf: *mut statx,
    );
}
extern "C" {
    pub fn io_uring_prep_fadvise(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        offset: __u64,
        len: __u32,
        advice: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_madvise(
        sqe: *mut io_uring_sqe,
        addr: *mut ::std::os::raw::c_void,
        length: __u32,
        advice: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_fadvise64(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        offset: __u64,
        len: off_t,
        advice: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_madvise64(
        sqe: *mut io_uring_sqe,
        addr: *mut ::std::os::raw::c_void,
        length: off_t,
        advice: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_send(
        sqe: *mut io_uring_sqe,
        sockfd: ::std::os::raw::c_int,
        buf: *const ::std::os::raw::c_void,
        len: usize,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_send_bundle(
        sqe: *mut io_uring_sqe,
        sockfd: ::std::os::raw::c_int,
        len: usize,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_send_set_addr(
        sqe: *mut io_uring_sqe,
        dest_addr: *const sockaddr,
        addr_len: __u16,
    );
}
extern "C" {
    pub fn io_uring_prep_sendto(
        sqe: *mut io_uring_sqe,
        sockfd: ::std::os::raw::c_int,
        buf: *const ::std::os::raw::c_void,
        len: usize,
        flags: ::std::os::raw::c_int,
        addr: *const sockaddr,
        addrlen: socklen_t,
    );
}
extern "C" {
    pub fn io_uring_prep_send_zc(
        sqe: *mut io_uring_sqe,
        sockfd: ::std::os::raw::c_int,
        buf: *const ::std::os::raw::c_void,
        len: usize,
        flags: ::std::os::raw::c_int,
        zc_flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_send_zc_fixed(
        sqe: *mut io_uring_sqe,
        sockfd: ::std::os::raw::c_int,
        buf: *const ::std::os::raw::c_void,
        len: usize,
        flags: ::std::os::raw::c_int,
        zc_flags: ::std::os::raw::c_uint,
        buf_index: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_sendmsg_zc(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        msg: *const msghdr,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_recv(
        sqe: *mut io_uring_sqe,
        sockfd: ::std::os::raw::c_int,
        buf: *mut ::std::os::raw::c_void,
        len: usize,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_recv_multishot(
        sqe: *mut io_uring_sqe,
        sockfd: ::std::os::raw::c_int,
        buf: *mut ::std::os::raw::c_void,
        len: usize,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_recvmsg_validate(
        buf: *mut ::std::os::raw::c_void,
        buf_len: ::std::os::raw::c_int,
        msgh: *mut msghdr,
    ) -> *mut io_uring_recvmsg_out;
}
extern "C" {
    pub fn io_uring_recvmsg_name(o: *mut io_uring_recvmsg_out) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn io_uring_recvmsg_cmsg_firsthdr(
        o: *mut io_uring_recvmsg_out,
        msgh: *mut msghdr,
    ) -> *mut cmsghdr;
}
extern "C" {
    pub fn io_uring_recvmsg_cmsg_nexthdr(
        o: *mut io_uring_recvmsg_out,
        msgh: *mut msghdr,
        cmsg: *mut cmsghdr,
    ) -> *mut cmsghdr;
}
extern "C" {
    pub fn io_uring_recvmsg_payload(
        o: *mut io_uring_recvmsg_out,
        msgh: *mut msghdr,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn io_uring_recvmsg_payload_length(
        o: *mut io_uring_recvmsg_out,
        buf_len: ::std::os::raw::c_int,
        msgh: *mut msghdr,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn io_uring_prep_openat2(
        sqe: *mut io_uring_sqe,
        dfd: ::std::os::raw::c_int,
        path: *const ::std::os::raw::c_char,
        how: *mut open_how,
    );
}
extern "C" {
    pub fn io_uring_prep_openat2_direct(
        sqe: *mut io_uring_sqe,
        dfd: ::std::os::raw::c_int,
        path: *const ::std::os::raw::c_char,
        how: *mut open_how,
        file_index: ::std::os::raw::c_uint,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct epoll_event {
    _unused: [u8; 0],
}
extern "C" {
    pub fn io_uring_prep_epoll_ctl(
        sqe: *mut io_uring_sqe,
        epfd: ::std::os::raw::c_int,
        fd: ::std::os::raw::c_int,
        op: ::std::os::raw::c_int,
        ev: *mut epoll_event,
    );
}
extern "C" {
    pub fn io_uring_prep_provide_buffers(
        sqe: *mut io_uring_sqe,
        addr: *mut ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
        nr: ::std::os::raw::c_int,
        bgid: ::std::os::raw::c_int,
        bid: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_remove_buffers(
        sqe: *mut io_uring_sqe,
        nr: ::std::os::raw::c_int,
        bgid: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_shutdown(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        how: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_unlinkat(
        sqe: *mut io_uring_sqe,
        dfd: ::std::os::raw::c_int,
        path: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_unlink(
        sqe: *mut io_uring_sqe,
        path: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_renameat(
        sqe: *mut io_uring_sqe,
        olddfd: ::std::os::raw::c_int,
        oldpath: *const ::std::os::raw::c_char,
        newdfd: ::std::os::raw::c_int,
        newpath: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_rename(
        sqe: *mut io_uring_sqe,
        oldpath: *const ::std::os::raw::c_char,
        newpath: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn io_uring_prep_sync_file_range(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        len: ::std::os::raw::c_uint,
        offset: __u64,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_mkdirat(
        sqe: *mut io_uring_sqe,
        dfd: ::std::os::raw::c_int,
        path: *const ::std::os::raw::c_char,
        mode: mode_t,
    );
}
extern "C" {
    pub fn io_uring_prep_mkdir(
        sqe: *mut io_uring_sqe,
        path: *const ::std::os::raw::c_char,
        mode: mode_t,
    );
}
extern "C" {
    pub fn io_uring_prep_symlinkat(
        sqe: *mut io_uring_sqe,
        target: *const ::std::os::raw::c_char,
        newdirfd: ::std::os::raw::c_int,
        linkpath: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn io_uring_prep_symlink(
        sqe: *mut io_uring_sqe,
        target: *const ::std::os::raw::c_char,
        linkpath: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn io_uring_prep_linkat(
        sqe: *mut io_uring_sqe,
        olddfd: ::std::os::raw::c_int,
        oldpath: *const ::std::os::raw::c_char,
        newdfd: ::std::os::raw::c_int,
        newpath: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_link(
        sqe: *mut io_uring_sqe,
        oldpath: *const ::std::os::raw::c_char,
        newpath: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_msg_ring_cqe_flags(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        len: ::std::os::raw::c_uint,
        data: __u64,
        flags: ::std::os::raw::c_uint,
        cqe_flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_msg_ring(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        len: ::std::os::raw::c_uint,
        data: __u64,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_msg_ring_fd(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        source_fd: ::std::os::raw::c_int,
        target_fd: ::std::os::raw::c_int,
        data: __u64,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_msg_ring_fd_alloc(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        source_fd: ::std::os::raw::c_int,
        data: __u64,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_getxattr(
        sqe: *mut io_uring_sqe,
        name: *const ::std::os::raw::c_char,
        value: *mut ::std::os::raw::c_char,
        path: *const ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_setxattr(
        sqe: *mut io_uring_sqe,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
        path: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        len: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_fgetxattr(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
        value: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_fsetxattr(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        name: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_int,
        len: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_socket(
        sqe: *mut io_uring_sqe,
        domain: ::std::os::raw::c_int,
        type_: ::std::os::raw::c_int,
        protocol: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_socket_direct(
        sqe: *mut io_uring_sqe,
        domain: ::std::os::raw::c_int,
        type_: ::std::os::raw::c_int,
        protocol: ::std::os::raw::c_int,
        file_index: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_socket_direct_alloc(
        sqe: *mut io_uring_sqe,
        domain: ::std::os::raw::c_int,
        type_: ::std::os::raw::c_int,
        protocol: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_cmd_sock(
        sqe: *mut io_uring_sqe,
        cmd_op: ::std::os::raw::c_int,
        fd: ::std::os::raw::c_int,
        level: ::std::os::raw::c_int,
        optname: ::std::os::raw::c_int,
        optval: *mut ::std::os::raw::c_void,
        optlen: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_prep_waitid(
        sqe: *mut io_uring_sqe,
        idtype: idtype_t,
        id: id_t,
        infop: *mut siginfo_t,
        options: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_futex_wake(
        sqe: *mut io_uring_sqe,
        futex: *mut u32,
        val: u64,
        mask: u64,
        futex_flags: u32,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_futex_wait(
        sqe: *mut io_uring_sqe,
        futex: *mut u32,
        val: u64,
        mask: u64,
        futex_flags: u32,
        flags: ::std::os::raw::c_uint,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct futex_waitv {
    _unused: [u8; 0],
}
extern "C" {
    pub fn io_uring_prep_futex_waitv(
        sqe: *mut io_uring_sqe,
        futex: *mut futex_waitv,
        nr_futex: u32,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_fixed_fd_install(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn io_uring_prep_cmd_discard(
        sqe: *mut io_uring_sqe,
        fd: ::std::os::raw::c_int,
        offset: u64,
        nbytes: u64,
    );
}
extern "C" {
    pub fn io_uring_sq_ready(ring: *const io_uring) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn io_uring_sq_space_left(ring: *const io_uring) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn io_uring_sqring_wait(ring: *mut io_uring) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_cq_ready(ring: *const io_uring) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn io_uring_cq_has_overflow(ring: *const io_uring) -> bool;
}
extern "C" {
    pub fn io_uring_cq_eventfd_enabled(ring: *const io_uring) -> bool;
}
extern "C" {
    pub fn io_uring_cq_eventfd_toggle(ring: *mut io_uring, enabled: bool) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_wait_cqe_nr(
        ring: *mut io_uring,
        cqe_ptr: *mut *mut io_uring_cqe,
        wait_nr: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_peek_cqe(
        ring: *mut io_uring,
        cqe_ptr: *mut *mut io_uring_cqe,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_wait_cqe(
        ring: *mut io_uring,
        cqe_ptr: *mut *mut io_uring_cqe,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_buf_ring_mask(ring_entries: __u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_buf_ring_init(br: *mut io_uring_buf_ring);
}
extern "C" {
    pub fn io_uring_buf_ring_add(
        br: *mut io_uring_buf_ring,
        addr: *mut ::std::os::raw::c_void,
        len: ::std::os::raw::c_uint,
        bid: ::std::os::raw::c_ushort,
        mask: ::std::os::raw::c_int,
        buf_offset: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_buf_ring_advance(br: *mut io_uring_buf_ring, count: ::std::os::raw::c_int);
}
extern "C" {
    pub fn io_uring_buf_ring_cq_advance(
        ring: *mut io_uring,
        br: *mut io_uring_buf_ring,
        count: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn io_uring_buf_ring_available(
        ring: *mut io_uring,
        br: *mut io_uring_buf_ring,
        bgid: ::std::os::raw::c_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_get_sqe(ring: *mut io_uring) -> *mut io_uring_sqe;
}
extern "C" {
    pub fn io_uring_mlock_size(
        entries: ::std::os::raw::c_uint,
        flags: ::std::os::raw::c_uint,
    ) -> isize;
}
extern "C" {
    pub fn io_uring_mlock_size_params(
        entries: ::std::os::raw::c_uint,
        p: *mut io_uring_params,
    ) -> isize;
}
extern "C" {
    pub fn io_uring_major_version() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_minor_version() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn io_uring_check_version(
        major: ::std::os::raw::c_int,
        minor: ::std::os::raw::c_int,
    ) -> bool;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct bufring_init_params_t {
    pub entries: u16,
    pub entry_size: u16,
    pub bgid: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bufring_init_params_t"][::std::mem::size_of::<bufring_init_params_t>() - 6usize];
    ["Alignment of bufring_init_params_t"]
        [::std::mem::align_of::<bufring_init_params_t>() - 2usize];
    ["Offset of field: bufring_init_params_t::entries"]
        [::std::mem::offset_of!(bufring_init_params_t, entries) - 0usize];
    ["Offset of field: bufring_init_params_t::entry_size"]
        [::std::mem::offset_of!(bufring_init_params_t, entry_size) - 2usize];
    ["Offset of field: bufring_init_params_t::bgid"]
        [::std::mem::offset_of!(bufring_init_params_t, bgid) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bufring_t {
    pub br: *mut io_uring_buf_ring,
    pub bufs: *mut iovec,
    pub params: bufring_init_params_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bufring_t"][::std::mem::size_of::<bufring_t>() - 24usize];
    ["Alignment of bufring_t"][::std::mem::align_of::<bufring_t>() - 8usize];
    ["Offset of field: bufring_t::br"][::std::mem::offset_of!(bufring_t, br) - 0usize];
    ["Offset of field: bufring_t::bufs"][::std::mem::offset_of!(bufring_t, bufs) - 8usize];
    ["Offset of field: bufring_t::params"][::std::mem::offset_of!(bufring_t, params) - 16usize];
};
impl Default for bufring_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn buffer_ring_init(ring: *mut io_uring, params: bufring_init_params_t) -> bufring_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bufpool_t {
    pub buf: *mut u8,
    pub iovecs: *mut iovec,
    pub freelist_mem: *mut bufpool_freebuf_t,
    pub freelist_head: *mut bufpool_freebuf_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bufpool_t"][::std::mem::size_of::<bufpool_t>() - 32usize];
    ["Alignment of bufpool_t"][::std::mem::align_of::<bufpool_t>() - 8usize];
    ["Offset of field: bufpool_t::buf"][::std::mem::offset_of!(bufpool_t, buf) - 0usize];
    ["Offset of field: bufpool_t::iovecs"][::std::mem::offset_of!(bufpool_t, iovecs) - 8usize];
    ["Offset of field: bufpool_t::freelist_mem"]
        [::std::mem::offset_of!(bufpool_t, freelist_mem) - 16usize];
    ["Offset of field: bufpool_t::freelist_head"]
        [::std::mem::offset_of!(bufpool_t, freelist_head) - 24usize];
};
impl Default for bufpool_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bufpool_freebuf_t {
    pub bid: u16,
    pub iov: *mut iovec,
    pub next: *mut bufpool_freebuf_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of bufpool_freebuf_t"][::std::mem::size_of::<bufpool_freebuf_t>() - 24usize];
    ["Alignment of bufpool_freebuf_t"][::std::mem::align_of::<bufpool_freebuf_t>() - 8usize];
    ["Offset of field: bufpool_freebuf_t::bid"]
        [::std::mem::offset_of!(bufpool_freebuf_t, bid) - 0usize];
    ["Offset of field: bufpool_freebuf_t::iov"]
        [::std::mem::offset_of!(bufpool_freebuf_t, iov) - 8usize];
    ["Offset of field: bufpool_freebuf_t::next"]
        [::std::mem::offset_of!(bufpool_freebuf_t, next) - 16usize];
};
impl Default for bufpool_freebuf_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn bufpool_init(ring: *mut io_uring, buf_size: usize, entries: usize) -> bufpool_t;
}
extern "C" {
    pub fn bufpool_pop(self_: *mut bufpool_t) -> *mut bufpool_freebuf_t;
}
extern "C" {
    pub fn bufpool_put(self_: *mut bufpool_t, bid: ::std::os::raw::c_int);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct appctx_t {
    pub uring: io_uring,
    pub bufpool: bufpool_t,
    pub bufrings: *mut bufring_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of appctx_t"][::std::mem::size_of::<appctx_t>() - 256usize];
    ["Alignment of appctx_t"][::std::mem::align_of::<appctx_t>() - 8usize];
    ["Offset of field: appctx_t::uring"][::std::mem::offset_of!(appctx_t, uring) - 0usize];
    ["Offset of field: appctx_t::bufpool"][::std::mem::offset_of!(appctx_t, bufpool) - 216usize];
    ["Offset of field: appctx_t::bufrings"][::std::mem::offset_of!(appctx_t, bufrings) - 248usize];
};
impl Default for appctx_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn appctx_init(
        uring_params: io_uring_params,
        bufring_params: *mut bufring_init_params_t,
        regbuf_pool_size: usize,
    ) -> appctx_t;
}
extern "C" {
    pub fn appctx_deinit(state: *mut appctx_t);
}
extern "C" {
    pub fn appctx_handle_accept(state: *mut appctx_t, cqe: *mut io_uring_cqe, msg: *mut msghdr);
}
extern "C" {
    pub fn appctx_handle_recvmsg(self_: *mut appctx_t, cqe: *mut io_uring_cqe);
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct userdata {
    pub __bindgen_anon_1: userdata__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union userdata__bindgen_ty_1 {
    pub __bindgen_anon_1: userdata__bindgen_ty_1__bindgen_ty_1,
    pub val: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct userdata__bindgen_ty_1__bindgen_ty_1 {
    pub fd: u32,
    pub op: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of userdata__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<userdata__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of userdata__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<userdata__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: userdata__bindgen_ty_1__bindgen_ty_1::fd"]
        [::std::mem::offset_of!(userdata__bindgen_ty_1__bindgen_ty_1, fd) - 0usize];
    ["Offset of field: userdata__bindgen_ty_1__bindgen_ty_1::op"]
        [::std::mem::offset_of!(userdata__bindgen_ty_1__bindgen_ty_1, op) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of userdata__bindgen_ty_1"][::std::mem::size_of::<userdata__bindgen_ty_1>() - 8usize];
    ["Alignment of userdata__bindgen_ty_1"]
        [::std::mem::align_of::<userdata__bindgen_ty_1>() - 8usize];
    ["Offset of field: userdata__bindgen_ty_1::val"]
        [::std::mem::offset_of!(userdata__bindgen_ty_1, val) - 0usize];
};
impl Default for userdata__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of userdata"][::std::mem::size_of::<userdata>() - 8usize];
    ["Alignment of userdata"][::std::mem::align_of::<userdata>() - 8usize];
};
impl Default for userdata {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const opcode_OP_LISTEN: opcode = 1;
pub const opcode_OP_ACCEPT: opcode = 2;
pub const opcode_OP_RECVMSG: opcode = 3;
pub const opcode_OP_WRITE: opcode = 4;
pub const opcode_OP_WRITE_FIXED: opcode = 5;
pub const opcode_OP_SENDMSG: opcode = 6;
pub type opcode = ::std::os::raw::c_uint;
extern "C" {
    pub fn encode_userdata(sqe: *mut io_uring_sqe, fd: u16, op: u8);
}
extern "C" {
    pub fn userdata_decode(cqe: *mut io_uring_cqe) -> userdata;
}
extern "C" {
    pub static mut fmt_addr: [::std::os::raw::c_char; 32usize];
}
extern "C" {
    pub fn format_inet_addr_from_sockfd(
        sockfd: ::std::os::raw::c_int,
        buf: *mut ::std::os::raw::c_char,
